{
  "name": "天工开物",
  "description": "天工开物初刊于1637年明崇祯十年天工开物是世界上第一部关于农业和手工业生产的综合性著作是中国古代一部综合性的科学技术著作有人也称它是一部百科全书式的著作作者是明朝科学家外国学者称它为“中国17世纪的工艺百科全书”作者在书中强调人类要和自然相协调人力要与自然力相配合是中国科技史料中保留最为丰富的一部它更多地着眼于手工业反映了中国明代末年出现资本主义萌芽时期的生产力状况",
  "articles": [
    {
      "title": "序",
      "content": [
        "天覆地载物数号万而事亦因之曲成而不遗岂人力也哉",
        "事物而既万矣必待口授目成而后识之其与几何万事万物之中其无益生人与有益者各载其半",
        "世有聪明博物者稠人推焉乃枣梨之花未赏而臆度楚萍釜鬻之范鲜经而侈谈莒鼎画工好图鬼魅而恶犬马即郑侨晋华岂足为烈哉",
        "幸生圣明极盛之世滇南车马纵贯辽阳岭徼宦商衡游蓟北为方万里中何事何物不可见见闻闻若为士而生东晋之初南宋之季共视燕秦晋豫方物已成夷产从互市而得裘帽何殊肃慎之矢也且夫王孙帝子生长深宫御厨玉粒正香而欲观未耜尚宫锦衣方剪而想像机丝当斯时也披图一观如获重宝矣",
        "年来著书一种名曰天工开物卷伤哉贫也欲购奇考证而乏洛下之资欲招致同人商略贋真而缺陈思之馆随其孤陋见闻藏诸方寸而写之岂有当哉吾友凃佰聚先生诚意动天心灵格物凡古今一言之嘉寸长可取必勤勤恳恳而契合焉昨岁画音归正由先生而授梓兹有后命复取此卷而继起为之其亦夙缘之所召哉卷分前后乃贵五穀而贱金玉之义观象乐律二卷其道太精自揣非吾事故临梓删去",
        "丐大业文人弃掷案头此书干功名进取毫不相关也",
        "时　祟祯丁丑孟夏月奉新宋应星书于家食之问堂"
      ]
    },
    {
      "title": "乃粒",
      "content": [
        "宋子曰上古神农氏若存若亡然味其徽号两言至今存矣生人不能久生而五谷生之五谷不能自生而生人生之土脉历时代而异种性随水土而分不然神农去陶唐粒食已千年矣耒耜之利以教天下岂有隐焉而纷纷嘉种必待后稷详明其故何也纨裤之子以赭衣视笠蓑经生之家以农夫为诟詈晨炊晚饷知其味而忘其源者众矣夫先农而系之以神岂人力之所为哉",
        "总名",
        "凡谷无定名百谷指成数言五谷则麻菽麦稷黍独遗稻者以著书圣贤起自西北也今天下育民人者稻居什七而来牟黍稷居什三麻菽二者功用已全入蔬饵膏馔之中而犹系之谷者从其朔也",
        "稻",
        "凡稻种最多不粘者禾曰亢米曰粳粘者禾曰余米曰糯南方无粘黍酒皆糯米所为质本粳而晚收带粘俗名婺源光之类不可为酒只可为粥者又一种性也凡稻谷形有长芒短芒江南名长芒者曰浏阳早短芒者曰吉安早长粒尖粒圆顶扁圆面不一其中米色有雪白牙黄大赤半紫杂黑不一",
        "湿种之期最早者春分以前名为社种遇天寒有冻死不生者最迟者后于清明凡播种先以稻麦稿包浸数日俟其生芽撒于田中生出寸许其名曰秧秧生三十日即拨起分栽若田亩逢旱干水溢不可插秧秧过期老而长节即栽于亩中生谷数粒结果而已凡秧田一亩所生秧供移栽二十五亩凡秧既分栽后早者七十日即收获粳有救公饥喉下急糯有金包银之类方语百千不可殚述最迟者历夏及冬二百日方收获其冬季播种仲夏即收者则广南之稻地无霜雪故也",
        "凡稻旬日失水即愁旱干夏种冬收之谷必山间源水不绝之亩其谷种亦耐久其土脉亦寒不催苗也湖滨之田待夏潦已过六月方栽者其秧立夏播种撒藏高亩之上以待时也南方平原田多一岁两栽两获者其再栽秧俗名晚糯非粳类也六月刈初禾耕治老膏田插再生秧其秧清明时已偕早秧撒布早秧一日无水即死此秧历四五两月任从烈日干无忧此一异也",
        "凡再植稻遇秋多晴则汲灌与稻相终始农家勤苦为春酒之需也凡稻旬日失水则死期至幻出旱稻一种粳而不粘者即高山可插又一异也香稻一种取其芳气以供贵人收实甚少滋益全无不足尚也",
        "稻宜",
        "凡稻土脉焦枯则穗实萧索勤农粪田多方以助之人畜秽遗榨油枯饼枯者以去膏而得名也胡麻莱菔子为上芸苔次之大眼桐又次之樟桕棉花又次之草皮木叶以佐生机普天之所同也南方磨绿豆粉者取溲浆灌田肥甚豆贱之时撒黄豆于田一粒烂土方寸得谷之息倍焉土性带冷浆者宜骨灰蘸秧根凡禽兽骨石灰淹苗足向阳暖土不宜也土脉坚紧者宜耕陇叠块压薪而烧之填坟松土不宜也",
        "稻工耕耙磨耙耘耔具图",
        "凡稻田刈获不再种者土宜本秋耕垦使宿稿化烂敌粪力一倍或秋旱无水及怠农春耕则收获损薄也凡粪田若撒枯浇泽恐霖雨至过水来肥质随漂而去谨视天时在老农心计也凡一耕之后勤者再耕三耕然后施耙则土质匀碎而其中膏脉释化也",
        "凡牛力穷者两人以扛悬耜项背相望而起土两人竟日仅敌一牛之力若耕后牛穷制成磨耙两人肩手磨轧则一日敌三牛之力也凡牛中国惟水黄两种水牛力倍于黄但畜水牛者冬与土室御寒夏与池塘浴水畜养心计亦倍于黄牛也凡牛春前力耕汗出切忌雨点将雨则疾驱入室候过谷雨则任从风雨不惧也",
        "吴郡力田者以锄代耜不藉牛力愚见贫农之家会计牛值与水草之资窃盗死病之变不若人力亦便假如有牛者供办十亩无牛用锄而勤者半之既已无牛则秋获之后田中无复刍牧之患而菽麦麻蔬诸种纷纷可种以再获偿半荒之亩似亦相当也",
        "凡稻分秧之后数日旧叶萎黄而更生新叶青叶既长则耔可施焉俗名挞禾植杖于手以足扶泥壅根并屈宿田水草使不生也凡宿田菵草之类遇耔而屈折而ㄗ稗与荼蓼非足力所可除者则耘以继之耘者苦在腰手辨在两眸非类既去而嘉谷茂焉从此泄以防潦溉以防旱旬月而“奄观銍刈”矣",
        "稻灾",
        "凡早稻种秋初收藏当午晒时烈日火气在内入仓廪中关闭太急则其谷粘带暑气勤农之家偏受此患明年田有粪肥土脉发烧东南风助暖则尽发炎火大坏苗穗此一灾也若种谷晚凉入廪或冬至数九天收贮雪水冰水一瓮交春即不验清明湿种时每石以数碗激洒立解暑气则任从东南风暖而此苗清秀异常矣祟在种内反怨鬼神",
        "凡稻撒种时或水浮数寸其谷未即沉下骤发狂风堆积一隅此二灾也谨视风定而后撒则沉匀成秧矣凡谷种生秧之后防雀聚食此三灾也立标飘扬鹰俑则雀可驱矣凡秧沉脚未定阴雨连绵则损折过半此四灾也邀天晴霁三日则粒粒皆生矣凡苗既函之后亩上肥泽连发南风薰热函内生虫形似蚕茧此五灾也邀天遇西风雨一阵则虫化而谷生矣凡苗吐穑之后暮夜“鬼火”游烧此六灾也此火乃朽木腹中放出凡木母火子子藏母腹母身未坏子性千秋不灭每逢多雨之年孤野坟墓多被狐狸穿塌其中棺板为水浸朽烂之极所谓母质坏也火子无附脱母飞扬然阴火不见阳光直待日没黄昏此火冲隙而出其力不能上腾飘游不定数尺而止凡禾穑叶遇之立刻焦炎逐火之人则他处树根放光以为鬼也奋梃击之反有鬼变枯柴之说不知向来鬼火见灯光而已化矣凡火未经人间传灯者总属阴火故见灯即灭",
        "凡苗自函活以至颖栗早者食水三斗晚者食水五斗失水即枯将刈之时少水一升谷数虽存米粒缩小入碾臼中亦多断碎此七灾也汲灌之智人巧已无余矣凡稻成熟之时遇狂风吹粒殒落或阴雨竟旬谷粒沾湿自烂此八灾也然风灾不越三十里阴雨灾不越三百里偏方厄难亦不广被风落不可为若贫困之家苦于无霁将湿谷升于锅内燃薪其下炸去糠膜收炒糗以充饥亦补助造化之一端矣",
        "水利　筒车　牛车　踏车　拔车　桔槔　皆具图",
        "凡稻防旱藉水独甚五谷厥土沙泥硗腻随方不一有三日即干者有半月后干者天泽不降则人力挽水以济凡河滨有制筒车者堰陂障流绕于车下激轮使转挽水入筒一一倾于枧内流入亩中昼夜不息百亩无忧不用水时拴木碍止使轮不转动其湖池不流水或以牛力转盘或聚数人踏转车身长者二丈短者半之其内用龙骨拴串板关水逆流而上大抵一人竟日之力灌田五亩而牛则倍之",
        "其浅池小浍不载长车者则数尺之车一人两手疾转竟日之功可灌二亩而已扬郡以风帆数扇俟风转车风息则止此车为救潦欲去泽水以便栽种盖去水非取水也不适济旱用桔槔辘轳功劳又甚细已",
        "麦",
        "凡麦有数种小麦曰来麦之长也大麦曰牟曰广杂麦曰雀曰荞皆以播种同时花形相似粉食同功而得麦名也四海之内燕秦晋豫齐鲁诸道民粒食小麦居半而黍稷稻粱仅居半西极川云东至闽浙吴楚腹焉方长六千里中种小麦者二十分而一磨面以为捻头环饵馒首汤料之需而饔飧不及焉种余麦者五十分而一闾阎作苦以充朝膳而贵介不与焉",
        "广麦独产陕西一名青稞即大麦随土而变而皮成青黑色者秦人专以饲马饥荒人乃食之大麦亦有粘者河洛用以酿酒雀麦细穗穗中又分十数细子间亦野生荞麦实非麦类然以其为粉疗饥传名为麦则麦之而已",
        "凡北方小麦历四时之气自秋播种明年初夏方收南方者种与收期时日差短江南麦花夜发江北麦花昼发亦一异也大麦种获期与小麦相同荞麦则秋半下种不两月而即收其苗遇霜即杀邀天降霜迟迟则有收矣",
        "麦工北耕种　耨　具图",
        "凡麦与稻初耕垦土则同播种以后则耘耔诸勤苦皆属稻麦惟施耨而已凡北方厥土坟垆易解释者种麦之法耕具差异耕即兼种其服牛起土者耒不用耕并列两铁于横木之上其具方语曰镪镪中间盛一小斗贮麦种于内其斗底空梅花眼牛行摇动种子即从眼中撒下欲密而多则鞭牛疾走子撒必多欲稀而少则缓其牛撒种即少既播种后用驴驾两小石团压土埋麦凡麦种紧压方生南地不与北同者多耕多耙之后然后以灰拌种手指拈而种之种过之后随以脚根压土使紧以代北方驴石也",
        "耕种之后勤议耨锄凡耨草用阔面大麦苗生后耨不厌勤有三过四过者余草生机尽诛锄下则竟亩精华尽聚嘉实矣功勤易耨南与北同也凡粪麦田既种以后粪无可施为计在先也陕洛之间忧虫蚀者或以砒霜拌种子南方所用惟炊烬也俗名地灰南方稻田有种肥田麦者不粪麦实当春小麦大麦青青之时耕杀田中蒸罨土性秋收稻谷必加倍也",
        "凡麦收空隙可再种他物自初夏至季秋时日亦半载择土宜而为之惟人所取也南方大麦有既刈之后乃种迟生粳稻者勤农作苦明赐无不及也凡荞麦南方必刈稻北方必刈菽稷而后种其性稍吸肥腴能使土瘦然计其获入业偿半谷有余勤农之家何妨再粪也",
        "麦灾",
        "凡麦防患抵稻三分之一播种以后雪霜晴潦皆非所计麦性食水甚少北土中春再沐雨水一升则秀华成嘉粒矣荆扬以南唯患霉雨倘成熟之时晴干旬日则仓禀皆盈不可胜食扬州谚云“寸麦不怕尺水”谓麦初长时任水灭顶无伤“尺麦只怕寸水”谓成熟时寸水软根倒茎沾泥则麦粒尽烂于地面也",
        "江南有雀一种有肉无骨飞食麦田数盈千万然不广及罹害者数十里而止江北蝗生则大之岁也",
        "黍稷　粱粟",
        "凡粮食米而不粉者种类甚多相去数百里则色味形质随方而变大同小异千百其名北人唯以大米呼粳稻而其余概以小米名之",
        "凡黍与稷同类粱与粟同类黍有粘有不粘粘者为酒稷有粳无粘凡粘黍粘粟统名曰秫非二种外更有秫也黍色赤白黄黑皆有而或专以黑色为稷未是至以稷米为先他谷熟堪供祭祀则当以早熟者为稷则近之矣凡黍在诗书有虋芑丕等名在今方语有牛毛燕颔马革驴皮稻尾等名种以三月为上时五月熟四月为中时七月熟五月为下时八月熟扬花结穗总与来牟不相见也凡黍粒大小总视土地肥硗时令害育宋儒拘定以某方黍定律未是也",
        "凡粟与粱统名黄米粘粟可为酒而芦粟一种名曰高粱者以其身高七尺如芦荻也粱粟种类名号之多视黍稷犹甚其命名或因姓氏山水或以形似时令总之不可枚举山东人唯以谷子呼之并不知粱粟之名也已上四米皆春种秋获耕耨之法与来牟同而种收之候则相悬绝云",
        "麻",
        "凡麻可粒可油者惟火麻胡麻二种胡麻即脂麻相传西汉始自大宛来古者以麻为五谷之一若专以火麻当之义岂有当哉窈意诗书五谷之麻或其种已灭或即菽粟之中别种而渐讹其名号皆未可知也",
        "今胡麻味美而功高即以冠百谷不为过火麻子粒压油无多皮为疏恶布其值几何胡麻数龠充肠移时不馁Х饵饴饧得粘其粒味高而品贵其为油也发得之而泽腹得之而膏腥膻得之而芳毒厉得之而解农家能广种厚实可胜言哉",
        "种胡麻法或治畦圃或垄田亩土碎草净之极然后以地灰微湿拌匀麻子而撒种之早者三月种迟者不出大暑前早种者花实亦待中秋乃结耨草之功唯锄是视其色有黑白赤三者其结角长寸许有四棱者房小而子少八棱者房大而子多皆因肥瘠所致非种性也收子榨油每石得四十斤余其枯用以肥田若饥荒之年则留供人食",
        "菽",
        "凡菽种类之多与稻黍相等播种收获之期四季相承果腹之功在人日用盖与饮食相终始",
        "一种大豆有黑黄两色下种不出清明前后黄者有五月黄六月爆冬黄三种五月黄收粒少而冬黄必倍之黑者刻期八月收淮北长征骡马必食黑豆筋力乃强",
        "凡大豆视土地肥硗耨草勤怠雨露足悭分收入多少凡为豉为酱为腐皆于大豆中取质焉江南又有高脚黄六月刈早稻方再种九十月收获江西吉郡种法甚妙其刈稻田竟不耕垦每禾稿头中拈豆三四粒以指扌及之其稿凝露水以滋豆豆性充发复浸烂稿根以滋已生苗之后遇无雨亢干则汲水一升以灌之一灌之后再耨之余收获甚多凡大豆入土未出芽时防鸠雀害驱之惟人",
        "一种绿豆圆小如珠绿豆必小暑方种未及小暑而种则其苗蔓延数尺结荚甚稀若过期至于处暑则随时开花结荚颗粒亦少豆种亦有二一曰摘绿荚先老者先摘人逐日而取之一曰拔绿则至期老足竟亩拔取也凡绿豆磨澄晒干为粉荡片搓索食家珍贵做粉溲浆灌田甚肥凡畜藏绿豆种子或用地灰石灰马蓼或用黄土拌收则四五月间不愁空蛀勤者逢晴频晒亦免蛀凡已刈稻田夏秋种绿豆必长接斧柄击碎土块发生乃多",
        "凡种绿豆一日之内遇大雨扳土则不复生既生之后防雨水浸疏沟浍以泄之凡耕绿豆及大豆田地耒耜欲浅不宜深入盖豆质根短而苗直耕土既深土块曲压则不生者半矣“深耕”二字不可施之菽类此先农之所未发者",
        "一种豌豆此豆有黑斑点形圆同绿豆而大则过之其种十月下来年五月收凡树木叶迟者其下亦可种",
        "一种蚕豆其荚似蚕形豆粒大于大豆八月下种来年四月收西浙桑树之下遍环种之盖凡物树叶遮露则不生此豆与豌豆树叶茂时彼已结荚而成实矣襄汉上流此豆甚多而贱果腹之功不啻黍稷也",
        "一种小豆赤小豆入药有奇功白小豆一名饭豆当冫食助嘉谷夏至下种九月收获种盛江淮之间",
        "一种音吕此豆古者野生田间今则北土盛种成粉荡皮可敌绿豆燕京负贩者终朝呼豆皮则其产必多矣",
        "一种白藊豆乃沿篱蔓生者一名蛾眉豆",
        "其他豇豆虎斑豆刀豆与大豆中分青皮褐色之类间繁一方者犹不能尽述皆充蔬代谷以粒民者博物者其可忽诸"
      ]
    },
    {
      "title": "乃服",
      "content": [
        "宋子曰人为万物之灵五官百体赅而存焉贵者垂衣裳煌煌山龙以治天下贱者衤豆褐裳冬以御寒夏以蔽体以自别于禽兽是故其质则造物之所具也属草木者为麻苘葛属禽兽与昆虫者裘褐丝绵各载其半而裳服充焉矣",
        "天孙机杼传巧人间从本质而见花因绣濯而得锦乃杼柚遍天下而得见花机之巧者能几人哉治乱经纶字义学者童而习之而终身不见其形象岂非缺憾也先列饲蚕之法以知丝源之所自盖人物相丽贵贱有章天实为之矣",
        "蚕种",
        "凡蛹变蚕蛾旬日破茧而出雌雄均等雌者伏而不动雄者两翅飞扑遇雌即交交一日半日方解解脱之后雄者中枯而死雌者即时生卵承藉卵生者或纸或布随方所用嘉湖用桑皮厚纸来年尚可再用一蛾计生卵二百余粒自然粘于纸上粒粒匀铺天然无一堆积蚕主收贮以待来年",
        "蚕浴",
        "凡蚕用浴法唯嘉湖两郡湖多用天露石灰嘉多用盐卤水每蚕纸一张用盐仓走出卤水二升参水浸于盂内纸浮其面石灰仿此逢腊月十二即浸浴至二十四计十二日周即漉起用微火烘干从此珍重箱匣中半点风湿不受直待清明抱产其天露浴者时日相同以篾盘盛纸摊开屋上四隅小石镇压任从霜雨风雨雷电满十二日方收珍重待时如前法盖低种经浴则自死不出不费叶故且得丝亦多也晚种不用浴",
        "种忌",
        "凡蚕纸用竹木四条为方架高悬透风避日梁枋之上其下忌桐油烟煤火气冬月忌雪映一映即空遇大雪下时即忙收贮明曰雪过依然悬挂直待腊月浴藏",
        "种类",
        "凡蚕有早晚二种晚种每年先早种五六日出川中者不同结茧亦在先其茧较轻三分之一若早蚕结茧时彼已出蛾生卵以便再养矣晚蛹戒不宜食凡三种浴种皆谨视原记如一错误或将天露者投盐浴则尽空不出矣凡茧色唯黄白二种川陕晋豫有黄无白嘉湖有白无黄若将白雄配黄雌则其嗣变成褐茧黄丝以猪胰漂洗亦成白色但终不可染漂白桃红二色",
        "凡茧形亦有数种晚茧结成亚腰葫卢样天露茧尖长如榧子形又或圆扁如核桃形又一种不忌泥涂叶者名为贱蚕得丝偏多",
        "凡蚕形亦有纯白虎斑纯黑花纹数种吐丝则同今寒家有将早雄配晚雌者幻出嘉种一异也野蚕自为茧出青州沂水等地树老即自生其丝为衣能御雨及垢污其蛾出即能飞不传种纸上他处亦有但稀少耳",
        "抱养",
        "凡清明逝三日蚕妙即不偎衣衾暖气自然生出蚕室宜向东南周围用纸糊风隙上无棚板者宜顶格值寒冷则用炭火于室内助暖凡初乳蚕将桑叶切为细条切叶不束稻麦镐为之则不损刀摘叶用瓮坛盛不欲风吹枯悴",
        "二眠以前腾筐方法皆用尖圆小竹筷提过二眠以后则不用箸而手指可拈矣凡腾筐勤苦皆视人工怠于腾者厚叶与粪湿蒸多致压死凡眠齐时皆吐丝而后眠若腾过须将旧叶些微拣净若粘带丝缠叶在中眠起之时恐其即食一口则其病为胀死三眠已过若天气炎热急宜搬出宽凉所亦忌风吹凡大眠后计上叶十二冫食方腾太勤则丝糙",
        "养忌",
        "凡蚕畏香复畏臭若焚骨灰淘毛圊者顺风吹来多致触死隔壁煎鲍鱼宿脂亦或触死灶烧煤炭炉沉檀亦触死懒妇便器摇动气侵亦有损伤若风则偏忌西南西南风太劲则有合箔皆僵者凡臭气触来急烧残桑叶烟以抵之",
        "叶料",
        "凡桑叶无土不生嘉湖用枝条垂压今年视桑树傍生条用竹钩挂卧逐渐近地面至冬月则抛土压之来春每节生根则剪开他栽其树精华皆聚叶上不复生葚与开花矣欲叶便剪摘则树至七八尺即斩截当顶叶则婆娑可扳伐不必乘梯缘木也其他用子种者立夏桑葚紫熟时取来用黄泥水搓洗并水浇于地面本秋即长尺余来春移栽倘灌粪勤劳亦易长茂但间有生葚与开花者则叶最薄少耳又有花桑叶薄不堪用者其树接过亦生厚叶也",
        "又有柘叶三种以济桑叶之穷柘叶浙中不经见川中最多寒家用浙种桑叶穷时仍啖柘叶则物理一也凡琴弦弓弦丝用柘养蚕名曰棘茧谓最坚韧",
        "凡取叶必用剪铁剪出嘉郡桐乡者最犀利他乡未得其利剪枝之法再生条次月叶愈茂取资既多人工复便凡再生条叶仲夏以养晚蚕则止摘叶而不剪条二叶摘后秋来三叶复茂浙人听其经霜自落片片扫拾以饲绵羊大获绒毡之利",
        "食忌",
        "凡蚕大眠以后径食湿叶雨天摘来者任从铺地加冫食晴日摘来者以水洒湿而饲之则丝有光泽未大眠时雨天摘叶用绳悬挂透风檐下时振其绳待风吹干若用手掌拍干则叶焦而不滋润他时丝亦枯色凡食叶眠前必令饱足而眠眠起即迟半日上叶无妨也雾天湿叶甚坏蚕其晨有雾切勿摘叶待雾收时或晴或雨方剪伐也露珠水亦待于干而后剪摘",
        "病症",
        "凡蚕卵中受病已详前款出后湿热积压妨忌在人初眠腾时用漆合者不可盖掩逼出气水凡蚕将病则脑上放光通身黄色头渐大而尾渐小并及眠之时游走不眠食叶又不多者皆病作也急择而去之勿使败群凡蚕强美者必眠叶面压在下者或力弱或性懒作茧亦薄其作茧不知收法妄吐丝成阔窝者乃蠢蚕非懒蚕也",
        "老足",
        "凡蚕食叶足候只争时刻自卵出少多在辰巳二时故老足结茧亦多辰巳二时老足者喉下两夹通明捉时嫩一分则丝少过老一分又吐去丝茧壳必薄捉者眼法高一只不差方妙黑色蚕不见身中透光最难捉",
        "结茧　山箔　具图",
        "凡结茧必如嘉湖方尽其法他国不知用火烘听蚕结出甚至丛杆之内箱匣之中火不经风不透故所为屯漳等绢豫蜀等绸皆易朽烂若嘉湖产丝成衣即入水浣濯百余度其质尚存其法析竹编箔其下横架料木约六尺高地下摆列炭火炭忌爆炸方圆去四五尺即列火一盆初上山时火分两略轻少引他成绪蚕恋火意即时造茧不复缘走",
        "茧绪既成即每盆加火半斤吐出丝来随即干燥所以经久不坏也其茧室不宜楼板遮盖下欲火而上欲风凉也凡火顶上者不以为种取种宁用火偏者其箔上山用麦稻稿斩齐随手纠捩成山顿插箔上做山之人最宜手健箔竹稀疏用短稿略铺洒妨蚕跌坠地下与火中也",
        "取茧",
        "凡茧造三日则下箔而取之其壳外浮丝一名丝匡者湖郡老妇贱价买去每斤百文用铜钱坠打成线织成湖绸去浮之后其茧必用大盘摊开架上以听治丝扩绵若用厨箱掩盖则郁而丝绪断绝矣",
        "物害",
        "凡害蚕者有雀鼠蚊三种雀害不及茧蚊害不及早蚕丝鼠害则与之相终始防驱之智是不一法唯人所行也雀屎粘叶蚕食之立刻死烂",
        "择茧",
        "凡取丝必用圆正独蚕茧则绪不乱若双茧并四五蚕共为茧择去取绵用或以为丝则粗甚",
        "造绵",
        "凡双茧并缫丝锅底零余并出种茧壳皆绪断乱不可为丝用以取绵用稻灰水煮过不宜石灰倾入清水盆内手大指去甲净尽指头顶开四个四四数足用拳顶开又四四十六拳数然后上小竹弓此庄子所谓纟光也",
        "湖绵独白净清化者总缘手法之妙上弓之时惟取快捷带水扩开若稍缓水流去则结块不尽解而色不纯白矣其治丝余者名锅底绵装绵衣衾内以御重寒谓之挟纩凡取绵人工难于取丝八倍竟日只得四两余用此绵坠打线织湖绸者价颇重以绵线登花机者名曰花绵价尤重",
        "治丝　  缫车　具图",
        "凡治丝先制丝车其尺寸器具开载后图锅煎极沸汤丝粗细视投茧多寡穷日之力一人可取三十两若包头丝则只取二十两以其苗长也凡绫罗丝一起投茧二十枚包头丝只投十余枚凡茧滚沸时以竹签拨动水面丝绪自见提绪入手引入竹针眼先绕星丁头以竹棍做成如香筒样然后由送丝竿勾挂以登大关车断绝之时寻绪丢上不必绕接其丝排匀不堆积者全在送丝竿与磨木之上川蜀丝车制稍异其法架横锅上引四五绪而上两人对寻锅中绪然终不若湖制之尽善也",
        "凡供治丝薪取极燥无烟湿者则宝色不损丝美之法有六字一曰“出口干”即结茧时用炭火烘一曰“出水干”则治丝登车时用炭火四五两盆盛去车关五寸许运转如风转时转转火意照干是曰出水干也若晴光又风色则不用火",
        "调丝",
        "凡丝议织时最先用调透光檐端宇下以木架铺地植竹四根于上名曰络笃丝匡竹上其傍倚柱高八尺处钉具斜安小竹偃月挂钩悬搭丝于钩内手中执{矍}旋缠以俟牵经织纬之用小竹坠石为活头接断之时扳之即下",
        "纬络　纺车　具图",
        "凡丝既{矍}之后以就经纬经质用少而纬质用多每丝十两经四纬六此大略也凡供纬{矍}以水沃湿丝摇车转铤而纺于竹管之上竹用小箭竹",
        "经具　溜眼　掌扇　经耙　印架　皆具图",
        "凡丝既{矍}之后牵经就织以直竹竿穿眼三十余透过篾圈名曰溜眼竿横架柱上丝从圈透过掌扇然后缠绕经耙之上度数既足将印架捆卷既捆中以交竹二度一上一下间丝然后扌及于筘内此筘非织筘扌及筘之后然的杠与印架相望登开五七丈或过糊者就此过糊或不过糊就此卷于的杠穿综就织",
        "过糊",
        "凡糊用面<角力>内小粉为质纱罗所必用绫绸或用或不用其染纱不存素质者用牛胶水为之名曰清胶纱糊浆承于筘上推移染透推移就干天气晴明顷刻而燥阴天必藉风力之吹也",
        "边维",
        "凡帛不论绫罗皆别牵边两傍各二十余缕边缕必过糊用筘推移梳干凡绫罗必三十丈五立十丈一穿以省穿接繁苦每匹应截画墨于边丝之上即知其丈尺之足边丝不登的杠别绕机梁之上",
        "经数",
        "凡织帛罗纱筘以八百齿为率绫绢筘以一千二百齿为率每筘齿中度经过糊者四缕合为二缕罗纱经计三千二百缕绫绸经计五千六千缕古书八十缕为一升今绫绢厚者古所谓六十升布也凡织花文必用嘉湖出口出水皆干丝为经则任从提挈不忧断接他省者即勉强提花潦草而已",
        "花机式　具全图",
        "凡花机通身度长一丈六尺隆起花楼中托衢盘下垂衢脚水磨竹棍为之计一千八百根对花楼下掘坑二尺许以藏衢脚地气湿者架棚二尺代之提花小厮坐立花楼架木上机末以的杠卷丝中间叠助木两枝直穿二木约四尺长其尖插于筘两头",
        "叠助织纱罗者视织绫绢者减轻十余斤方妙其素罗不起花纹与软纱绫绢踏成浪梅小花者视素罗只加桄二扇一人踏织自成不用提花之人闲住花楼亦不设衢盘与衢脚也其机式两接前一接平安自花楼向身一接斜倚低下尺许则叠助力雄若织包头细软则另为均平不斜之机坐处斗二脚以其丝微细防遏叠助之力也",
        "腰机式　具图",
        "凡织杭西罗地等绢轻素等绸银条巾帽等纱不必用花机只用小机织匠以熟皮一方置坐下其力全在腰尻之上故名腰机普天织葛苎棉布者用此机法布帛更整齐坚泽惜今传之犹未广也",
        "结花本",
        "凡工匠结花本者心计最精巧画师先画何等花色于纸上结本者以丝线随画量度算计分寸杪忽而结成之张悬花楼之上即织者不知成何花色穿综带经随甚尺寸度数提起衢脚梭过之后居然花现盖绫绢以浮轻而见花纱罗以纠纬而见花绫绢一梭一提纱罗来梭提往梭不提天孙机杼人巧备矣",
        "穿经",
        "凡丝穿综度经必用四人列坐过筘之人手执筘耙先插以待丝至丝过筘则两指执定足五七十筘则绦结之不乱之妙消息全在交竹即接断就丝一扯即长数寸打结之后依还原度此丝本质自具之妙也",
        "分名",
        "凡罗中空小路以透风凉其消息全在软综之中衮头两扇打综一软一硬凡五梭三梭最厚者七梭之后踏起软综自然纠转诸经空路不粘若平过不空路而仍稀者曰纱消息亦在两扇衮头之上直至织花绫绸则去此两扇而用桄综八扇",
        "凡左右手各用一梭交互织者曰绉纱凡单经曰罗地双经曰绢地五经曰绫地凡花分实地与绫地绫地者光实地者暗先染丝而后织者曰缎北土土屯绢亦先染丝就丝绸机上织时两梭轻一梭重空出稀路者名曰秋罗此法亦起近代凡吴越秋罗闽广怀素皆利绅当暑服屯绢则为外官卑官逊别锦绣用也",
        "熟练",
        "凡帛织就犹是生丝煮练方熟练用稻稿灰入水煮以猪胰脂陈宿一晚入汤浣之宝色烨然或用乌梅者宝色略减凡早丝为轻晚丝为纬者练熟之时每十两轻去三两经纬皆美好早丝轻化只二两练后日干张急以大蚌壳磨使乖钝通身极力刮过以成宝色",
        "龙袍",
        "凡上供龙袍我朝局在苏杭其花楼高一丈五尺能手两人扳提花本织来数寸即换龙形各房斗合不出一手赭黄亦先染丝工器原无殊异但人工慎重与资本皆数十倍以效忠敬之谊其中节目微细不可得而详考云",
        "倭缎",
        "凡倭缎制起东夷漳泉海滨效法为之丝质来自川蜀商人万里贩来以易胡椒归里其织法亦自夷国传来盖质已先染而斫绵夹藏经面织过数寸即刮成黑光北虏互市者见而悦之但其帛最易朽污冠弁之上顷刻集灰衣领之间移日损坏今华夷皆贱之将来为弃物织法可不传云",
        "布衣　赶　弹　纺　具图",
        "凡棉布御寒贵贱同之棉花古书名麻种遍天下种有木棉草棉两者花有白紫二色种者白居十九紫居十一凡棉春种秋花花先绽者逐日摘取取不一时其花粘子于腹登赶车而分之去子取花悬弓弹化为挟纩温衾袄者就此止功弹后以木板擦成长条以登纺车引绪纠成纱缕然后绕{矍}牵经就织凡纺工能者一手握三管纺于铤上捷则不坚",
        "凡棉布寸土皆有而织造尚松江浆染尚芜湖凡布缕紧则坚缓则脆碾石取江北性冷质腻者每块佳者值十余金石不发烧则缕紧不松泛芜湖巨店首尚佳石广南为布薮而偏取远产必有所试矣为衣敝浣犹尚寒砧捣声其义亦犹是也",
        "外国朝鲜造法相同惟西洋则未核其质并不得其机织之妙凡织布有云花斜文象眼等皆仿花机而生义然既曰布衣太素足矣织机十室必有不必具图",
        "著",
        "凡衣衾挟纩御寒百有之中止一人用茧绵余皆著古袍今俗名胖袄棉花既弹化相衣衾格式而入装之新装者附体轻暖经年板紧暖气渐无取出弹化而重装之其暖如故",
        "夏服",
        "凡苎麻无土不生其种植有撒子分头两法池郡每岁以草粪压头其根随土而高广南青麻撒子种田茂甚色有青黄两样每岁有两刈者有三刈者绩为当暑衣裳帷帐",
        "凡苎皮剥取后喜日燥干见水即烂破析时则以水浸之然只耐二十刻久而不析则亦烂苎质本淡黄漂工化成至白色先用稻灰石灰水煮过入长流水再漂再晒以成至白纺苎纱能者用脚车一女工并敌三工惟破析时穷日之力只担三五铢重织苎机具与织棉者同凡布衣缝线革履串绳其质必用苎纠合",
        "凡葛蔓生质长于苎数尺破析至细者成布贵重又有м麻一种成布甚粗最粗者以充丧服即苎布有极粗者漆家以盛布灰大内以充火炬又有蕉纱乃闽中取芭蕉皮析缉为之轻细之甚值贱而质枵不可为衣也",
        "裘",
        "凡取兽皮制服统名曰裘贵至貂狐贱至羊麂值分百等貂产辽东外徼建州地及朝鲜国其鼠好食松子夷人夜伺树下屏息悄声而射取之一貂之皮方不盈尺积六十余貂仅成一裘服貂裘者立风雪中更暖于宇下眯入目中拭之即出所以贵也色有三种一白者曰银貂一纯黑一黯黄黑而毛长者近值一帽套已五十金凡狐貂亦产燕齐辽汴诸道纯白狐腋裘价与貂相仿黄褐狐裘值貂五分之一御寒温体功用次于貂凡关外狐取毛见底青黑中国者吹开见白色以此分优劣",
        "羊皮裘母贱子贵在腹者名曰胞羔毛文略具初生者名曰乳羔皮上毛似耳环脚三月者曰跑羔七月者曰走羔毛文渐直胞羔乳羔为裘不膻古者羔裘为大夫之服今西北绅亦贵重之其老大羊皮硝熟为裘裘质痴重则贱者之服耳然此皆绵羊所为若南方短毛革硝其享如纸薄止供画灯之用而已服羊裘者腥膻之气习久而俱化南方不习者不堪也然寒凉渐杀亦无所用之",
        "麂皮去毛硝熟为袄裤御风便体袜靴更佳此物广南繁生外中土则积集聚楚中望华山为市皮之所麂皮且御蝎患北人制衣而外割条以缘衾边则蝎自远去虎豹至文将军用以彰身犬豕至贱役夫用以适足西戎尚獭皮以为毳衣领饰襄黄之人穷山越国射取而远货得重价焉殊方异物如金丝猿上用为帽套扯里狲御服以为袍皆非中华物也兽皮衣人此其大略方物则不可殚述飞禽之中有取鹰腹雁胁毳毛杀生盈万乃得一裘名天鹅绒者将焉用之",
        "褐毡",
        "凡绵羊有二种一曰蓑衣羊剪其毳为毡为绒片帽袜遍天下胥此出焉古者西域羊未入中国作褐为贱者服亦以其毛为之褐有粗而无精今日粗褐亦间出此羊之身此种自徐淮以北州郡无不繁生南方唯湖郡饲畜绵羊一岁三剪毛夏季稀革不生每羊一只岁得绒袜料三双生羔牝牡合数得二羔故北方家畜绵羊百只则岁入计百金云",
        "一种{矛ぁ}{艹刁}羊番语唐末始自西域传来外毛不甚蓑长内毳细软取织绒褐秦人名曰山羊以别于绵羊此种先自西域传入临洮今兰州独盛故褐之细者皆出兰州一曰兰绒番语谓之孤古绒从其初号也山羊毳绒亦分两等一曰ㄐ绒用梳栉ㄐ下打线织帛曰褐子把子诸名色一曰拔绒乃毳毛精细者以两指甲逐茎ㄎ下打线织绒褐此褐织成揩面如丝帛滑腻每人穷日之力打线只得一钱重费半载工夫方成匹帛之料若ㄐ绒打线日多拔绒数倍凡打褐绒线冶铅为锤坠于绪端两手宛转搓成",
        "凡织绒褐机大于布机用综八扇穿经度缕下施四踏轮踏起经隔二抛纬故织出文成斜现其梭长一尺二寸机织羊种皆彼时归夷传来名姓再详故至今织工皆其族类中国无典也凡绵羊剪毳粗者为毡细者为绒毡皆煎烧沸汤投于其中搓洗俟其粘合以木板定物式铺绒其上运轴赶成凡毡绒白黑为本色其余皆染色其氍俞氆鲁等名称皆华夷各方语所命若最粗而为毯者则驽马诸料杂错而成非专取料于羊也"
      ]
    },
    {
      "title": "彰施",
      "content": [
        "宋子曰霄汉之间云霞异色阎浮之内花叶殊形天垂象而圣人则之以五彩彰施于五色有虞氏岂无所用其心哉飞禽众而凤则丹走兽盈而麟则碧夫林林青衣望阙而拜黄朱也其义亦犹是矣君子曰“甘受和白受采”世间丝麻裘褐皆具素质而使殊颜异色得以尚焉谓造物不劳心者吾不信也",
        "诸色质料",
        "大红色其质红花饼一味用乌梅水煎出又用碱水澄数次或稻稿灰代碱功用亦同澄得多次色则鲜甚染房讨便宜者先染芦木打脚凡红花最忌沉麝袍服与衣香共收旬月之间其色即毁凡红花染帛之后若欲退转但浸湿所染帛以碱水稻灰水滴上数十点其红一毫收转仍还原质所收之水藏于绿豆粉内放出染红半滴不耗染家以为秘诀不以告人莲红桃红色银红水红色以上质亦红花饼一味浅深分两加减而成是四色皆非黄茧丝所可为必用白丝方现木红色用苏木煎水入明矾子紫色苏木为地青矾尚之赭黄色制未详鹅黄色黄蘖煎水染靛水盖上金黄色芦木煎水染复用麻稿灰淋碱水漂茶褐色莲子壳煎水染复用青矾水盖大红官绿色槐花煎水染蓝淀盖浅深皆用明矾豆绿色黄蘖水染靛水盖今用小叶苋蓝煎水盖者名草豆绿色甚鲜油绿色槐花薄染青矾盖天青色入靛缸浅染苏木水盖蒲萄青色入靛缸深染苏木水深盖蛋青色黄蘖水染然后入靛缸翠蓝天蓝二色俱靛水分深浅玄色靛水染深青芦木杨梅皮等分煎水盖又一法将蓝芽叶水浸然后下青矾子同浸令布帛易朽月白草色二色俱靛水微染今法用苋蓝煎水半生半熟染象牙色芦木煎水薄染或用黄土藕褐色苏木水薄染入莲子壳青矾水薄盖",
        "附染包头青色此黑不出蓝靛用栗壳或莲子壳煎煮一日漉起然后入铁砂皂矾锅内再煮一宵即成深黑色",
        "附染毛青布色法布青初尚芜湖千百年矣以其浆碾成青光边方外国皆贵重之人情久则生厌毛青乃出近代其法取松江美布染成深青不复浆碾吹干用胶水参豆浆水一过先蓄好靛名曰标缸入内薄染即起红焰之色隐然此布一时重用",
        "蓝淀",
        "凡蓝五种皆可为淀茶蓝即菘蓝插根活蓼蓝马蓝吴蓝等皆撒子生近又出蓼蓝小叶者俗名苋蓝种更佳",
        "凡种茶蓝法冬月割获将叶片片削下入窖造淀其身斩去上下近根留数寸薰干埋藏土内春月烧净山土使极肥松然后用锥锄其锄勾末向身长八寸许刺土打斜眼插入于内自然活根生叶其余蓝皆收子撒种畦圃中暮春生苗六月采实七月刈身造淀",
        "凡造淀叶者茎多者入窖少者入桶与缸水浸七日其汁自来每水浆一石下石灰五升搅冲数十下淀信即结水性定时淀沉于底近来出产闽人种山皆茶蓝其数倍于诸蓝山中结箬篓输入舟航其掠出浮沫晒干者曰靛花凡靛入缸必用稻灰水先和每日手执竹棍搅动不可计数其最佳者曰标缸",
        "红花",
        "红花场圃撒子种二月初下种若太早种者苗高尺许即生虫如黑蚁食根立毙凡种地肥者苗高二三尺每路打橛缚绳横阑以备狂风拗折若瘦地尺五以下者不必为之",
        "红花入夏即放绽花下作求汇多刺花出求上采花者必侵晨带露摘取若日高露旰其花即已结闭成实不可采矣其朝阴雨无露放花较少旰摘无妨以无日色故也红花逐日放绽经月乃尽入药用者不必制饼若入染家用者必以法成饼然后用则黄汁净尽而真红乃现也其子煎压出油或以银箔贴扇面用此油一刷火上照干立成金色",
        "造红花饼法",
        "带露摘红花捣熟以水淘布袋绞去黄汁又捣以酸粟或米泔清又淘又绞袋去汁以青蒿覆一宿捏成薄饼阴干收贮染家得法我朱孔扬所谓猩红也染纸吉礼用亦必紫矿不然全无色",
        "附燕脂",
        "燕脂古造法以紫矿染绵者为上红花汁及山榴花汁者次之近济宁路但取染残红花滓为之值甚贱其滓干者名曰紫粉丹青家或收用染家则糟粕弃也",
        "槐花",
        "凡槐树十余年后方生花实花初试未开者曰槐蕊绿衣所需犹红花之成红也取者张度籅稠其下而承之以水煮一沸漉干捏成饼入染家用既放之花色渐入黄收用者以石灰少许晒拌而藏之"
      ]
    },
    {
      "title": "粹精",
      "content": [
        "宋子曰天生五谷以育民美在其中有黄裳之意焉稻以糠为甲麦以<麦夫>为衣粟粱黍稷毛羽隐然播精而择粹其道宁终秘也饮食而知味者食不厌精杵臼之利万民以济盖取诸小过为此者岂非人貌而天者哉",
        "攻稻击禾　轧禾　风车　水碓　石碾　臼　碓　筛　皆具图",
        "凡稻刈获之后离稿取粒束稿于手而击取者半聚稿于场而曳牛滚石以取者半凡束手而击者受击之物或用木桶或用石板收获之时雨多霁少田稻交湿不可登场者以木桶就田击取晴霁稻干则用石板甚便也",
        "凡服牛曳石滚压场中视人手击取者力省三倍但作种之谷恐磨去壳尖减削生机故南方多种之家场禾多藉牛力而来年作种者则宁向石板击取也",
        "凡稻最佳者九穰一秕倘风雨不时耘耔失节则六穰四秕者容有之凡去秕南方尽用风车扇去北方稻少用扬法即以扬麦黍者扬稻盖不若风车之便也",
        "凡稻去壳用砻去膜用舂用碾然水碓主舂则兼并砻功燥干之谷入碾亦省砻也凡砻有二种一用木为之截木尺许质多用松斫合成大磨形两扇皆凿纵斜齿下合植┺穿贯上合空中受谷木砻攻米二千余石其身乃尽凡木砻谷不甚燥者入砻亦不碎故入贡军国漕储千万皆出此中也",
        "一土砻析竹匡围成圈实洁净黄土于内上下两面各嵌竹齿上合ド空受谷其量倍于木砻谷稍滋湿者入其中即碎断土砻攻米二百石其身乃朽凡木砻必用健夫土砻即孱妇弱子可胜其任庶民饔飧皆出此中也",
        "凡既砻则风扇以去糠秕倾入筛中团转谷未剖破者浮出筛面重复入砻凡筛大者围五尺小者半之大者其中心偃隆而起健夫利用小者弦高二寸其中平洼妇子所需也凡稻米既筛之后入臼而舂臼亦两种八口以上之家堀地藏石臼其上臼量大者容五斗小者半之横木穿插碓头碓嘴冶铁为之用醋滓合上足踏其末而舂之不及则粗太过则粉精粮从此出焉晨炊无多者断木为手杵其臼或木或石以受舂也既舂以后皮膜成粉名曰细糠以供犬豕之豢荒歉之岁人亦可食也细糠随风扇播扬分去则膜尘净尽而粹精见矣",
        "凡水碓山国之人居河滨者之所为也攻稻之法省人力十倍人乐为之引水成功即筒车灌田同一制度也设臼多寡不一值流水少而地窄者或两三臼流水洪而地室宽者即并列十臼无忧也",
        "江南信郡水碓之法巧绝盖水碓所愁者埋臼之地卑则洪潦为患高则承流不及信郡造法即以一舟为地橛桩维之筑土舟中陷臼于其上中流微堰石梁而碓已造成不烦木壅坡之力也又有一举而三用者激水转轮头一节转磨成面二节运碓成米三节引水灌于稻田此心计无遗者之所为也凡河滨水碓之国有老死不见砻者去糠去膜皆以臼相终始惟风筛之法则无不同也",
        "凡砌石为之承藉转轮皆用石牛犊马驹惟人所使盖一牛之力日可得五人但入其中者必极燥之谷稍润则碎断也",
        "攻麦　　磨　罗　具图",
        "凡小麦其质为面盖精之至者稻中再舂之米粹之至者麦中重罗之面也",
        "小麦收获时束稿击取如击稻法其去秕法北土用盖风扇流传未遍率土也凡不在宇下必待风至而后为之风不至雨不收皆不可为也",
        "凡小麦既之后以水淘洗尘垢净尽又复晒干然后入磨凡小麦有紫黄二种紫胜于黄凡佳者每石得面一百二十斤劣者损三分之一也",
        "凡磨大小无定形大者用肥健力牛曳转其牛曳磨时用桐壳掩眸不然则眩晕其腹系桶以盛遗不然则秽也次者用驴磨斤两稍轻又次小磨则止用人推挨者",
        "凡力牛一日攻麦二石驴半之人则强者攻三斗弱者半之若水磨之法其详已载攻稻“水碓”中制度相同其便利又三倍于牛犊也",
        "凡牛马与水磨皆悬袋磨上上宽下窄贮麦数斗于中溜入磨眼人力所挨则不必也",
        "凡磨石有两种面品由石而分江南少粹白上面者以石怀沙滓相磨发烧则其<麦夫>并破故黑参和面中无从罗去也江北石性冷腻而产于池郡之九华山者美更甚以此石制磨石不发烧其<麦夫>压至扁秕之极不破则黑疵一毫不入而面成至白也凡江南磨二十日即断齿江北者经半载方断南磨破<麦夫>得面百斤北磨只得八十斤故上面之值增十之二然面<角力>小粉皆从彼磨出则衡数已足得值更多焉",
        "凡麦经磨之后几番入罗勤者不厌重复罗匡之底用丝织罗地绢为之湖丝所织者罗面千石不损若他方黄丝所为经百石而已朽也凡面既成后寒天可经三月春夏不出二十日则郁坏为食适口贵及时也",
        "凡大麦则就舂去膜炊饭而食为粉者十无一焉荞麦则微加舂杵去衣然后或舂或磨以成粉而后食之盖此类之视小麦精粗贵贱大径庭也",
        "攻黍稷粟粱麻菽　小碾　枷　具图",
        "凡攻治小米扬得其实舂得其精磨得其粹风扬车扇而外簸法生焉其法篾织为圆盘铺米其中挤匀扬播轻者居前簸弃地下重者在后嘉实存焉凡小米舂磨扬播制器已详稻麦之中唯小碾一制在稻麦之外北方攻小米者家置石墩中高边下边沿不开槽铺米墩上妇子两人相向接手而碾之其碾石图长如牛赶石而两头插木柄米堕边时随手以小扫上家有此具杵臼竟悬也",
        "凡胡麻刈获于烈日中晒干束为小把两手执把相击麻粒绽落承藉以簟席也凡麻筛与米筛小者同形而目密五倍麻从目中落叶残角屑皆浮筛上而弃之",
        "凡豆菽刈获少者用枷多而省力者仍铺场烈日晒干牛曳石赶而压落之凡打豆枷竹木竿为柄其端锥圆眼拴木一条长三尺许铺豆于场执柄而击之",
        "凡豆击之后用风扇扬去荚叶筛以继之嘉实洒然入禀矣是故舂磨不及麻碾不及菽也"
      ]
    },
    {
      "title": "作咸",
      "content": [
        "宋子曰天有五气是生五味润下作咸王访箕子而首闻其义焉口之于味也辛酸甘苦经年绝一无恙独食盐禁戒旬日则缚鸡胜匹倦怠恹然岂非“天一生水”而此味为生人生气之源哉四海之中五服而外为蔬为谷皆有寂灭之乡而斥卤则巧生以待孰知其所已然",
        "盐产",
        "凡盐产最不一海池井土崖砂石略分六种而东夷树叶西戎光明不与焉赤县之内海卤居十之八而其二为井池土碱或假人力或由天造总之一经舟车穷窘则造物应付出焉",
        "海水盐",
        "凡海水自具咸质海滨地高者名潮墩下者名草荡地皆产盐同一海卤传神而取法则异一法高堰地潮波不没者地可种盐种户各有区画经界不相侵越度诘朝无雨则今日广布稻麦稿灰及芦茅灰寸许于地上压使平匀明晨露气冲腾则其下盐茅勃发日中晴霁灰盐一并扫起淋煎一法潮波浅被地不用灰压候潮一过明日天晴半日晒出盐霜疾趋扫起煎炼一法逼海潮深地先掘深坑横架竹木上铺席苇又铺沙于苇席上俟潮灭顶冲过卤气由沙渗下坑中撤去沙苇以灯烛之卤气冲灯即灭取卤水煎炼总之功在晴霁若淫雨连旬则谓之盐荒又淮场地面有日晒自然生霜如马牙者谓之大晒盐不由煎炼扫起即食海水顺风飘来断草勾取煎炼名蓬盐",
        "凡淋煎法掘坑二个一浅一深浅者尺许以竹木架芦席于上将扫来盐料不论有灰无灰淋法皆同铺于席上四围隆起作一堤当形中以海水灌淋渗下浅坑中深者深七八尺受浅坑所淋之汁然后入锅煎炼",
        "凡煎盐锅古谓之牢盆亦有两种制度其盆周阔数丈径亦丈许用铁者以铁打成叶片铁钉栓合其底平如盂其四周高尺二寸其合缝处一以卤汁结塞永无隙漏其下列灶燃薪多者十二三眼少者七八眼共煎此盘南海有编竹为者将竹编成阔丈深尺糊以蜃灰附于釜背火燃釜底滚沸延及成盐亦名盐盆然不若铁叶镶成之便也凡煎卤未即凝结将皂角椎碎和粟米糠二味卤沸之时投入其中搅和盐即顷刻结成盖皂角结盐犹石膏之结腐也",
        "凡盐淮扬场者质重而黑其他质轻而白以量较之淮场者一升重十两则广浙长芦者只重六七两凡蓬草盐不可常期或数年一至或一月数至凡盐见水即化见风即卤见火愈坚凡收藏不必用仓廪盐性畏风不畏湿地下叠稿三寸任从卑湿无伤周遭以土砖泥隙上盖茅草尺许百年如故也",
        "池盐",
        "凡池盐宇内有二一出宁夏供食边镇一出山西解池供晋豫诸郡县解池界安邑猗氏临晋之间其池外有城堞周遭禁御池水深聚处其色绿沉土人种盐者池傍耕地为畦陇引清水入所耕畦中忌浊水参入即淤淀盐脉",
        "凡引水种盐春间即为之久则水成赤色待夏秋之交南风大起则一宵结成名曰颗盐即古志所谓大盐也以海水煎者细碎而此成粒颗故得大名其盐凝结之后扫起即成食味种盐之人积扫一石交官得钱数十文而已其海丰深州引海水入池晒成者凝结之时扫食不加人力与解盐同但成盐时日与不藉南风则大异也",
        "井盐",
        "凡滇蜀两省远离海滨舟车艰通形势高上其咸脉即韫藏地中凡蜀中石山去河不远者多可造井取盐盐井周围不过数寸其上口一小盂覆之有余深必十丈以外乃得卤性故造井功费甚难",
        "其器冶铁锥如碓嘴形其尖使极刚利向石山舂凿成孔其身破竹缠绳夹悬此锥每舂深入数尺则又以竹接其身使引而长初入丈许或以足踏锥梢如舂米形太深则用手捧持顿下所舂石成碎粉随以长竹接引悬铁盏挖之而上大抵深者半载浅者月余乃得一井成就",
        "盖井中空阔则卤乞游散不克结盐故也井及泉后择美竹长丈者凿净其中节留底不去其喉下安消息吸水入筒用长ㄌ系竹沉下其中水满井上悬桔槔辘轳诸具制盘驾牛牛曳盘转辘轳绞ㄌ汲水而上入于釜中煎炼只用中釜不用牢盆顷刻结盐色成至白",
        "西川有火井事奇甚其井居然冷水绝无火气但以长竹剖开去节合缝漆布一头插入井底其上曲接以口紧对釜脐注卤水釜中只见火意烘烘水即滚沸启竹而视之绝无半点焦炎意未见火形而用火神此世间大奇事也凡川滇盐井逃课掩盖至易不可穷诘",
        "末盐",
        "凡地碱煎盐除并州末盐外长芦分司地土人亦有刮削煎成者带杂黑色味不甚佳",
        "崖盐",
        "凡西省阶凤等州邑海井交穷其岩穴自生盐色如红土恣人刮取不假煎炼"
      ]
    },
    {
      "title": "甘嗜",
      "content": [
        "宋子曰气至于芳色至于<青色>味至于甘人之大欲存焉芳而烈<青色>而艳甘而甜则造物有尤异之思矣世间作甘之味什八产于草木而飞虫竭力争衡采取百花酿成佳味使草木无全功孰主张是而颐养遍于天下哉",
        "蔗种",
        "凡甘蔗有二种产繁闽广间他方合并得其什一而已似竹而大者为果蔗截断生啖取汁适口不可以造糖似荻而小者为糖蔗口啖即棘伤唇舌人不敢食白霜红砂皆从此出凡蔗古来中国不知造糖唐大历间西僧邹和尚游蜀中遂宁始传其法今蜀中种盛亦自西域渐来也",
        "凡种荻蔗冬初霜将至将蔗斫伐去杪与根埋藏土内土忌洼聚水湿处雨水前五六日天色晴明即开出去外壳斫断约五六寸以两个节为率密布地上微以土掩之头尾相枕若鱼鳞然两芽平放不得一上一下致芽向土难发芽长一二寸频以清粪水浇之俟长六七寸锄起分栽",
        "凡栽蔗必用夹沙土河滨洲土为第一试验土色掘坑尺五许将沙土入口尝味味苦者不可栽蔗凡洲土近深山上流河滨者即土味甘亦不可种盖山气凝寒则他日糖味亦焦苦去山四五十里平阳洲土择佳而为之黄泥脚地毫不可为",
        "凡栽蔗治畦行阔四尺犁沟深四寸蔗栽沟内约七尺列三丛掩土寸许土太厚则芽发稀少也芽发三四个或六七个时渐渐下土遇锄耨时加之加土渐厚则身长根深庶免欹倒之患凡锄耨不厌勤过浇粪多少视土地肥硗长至一二尺则将胡麻或芸苔枯浸和水灌灌肥欲施行内高二三尺则用牛进行内耕之半月一耕用犁一次垦土断傍根一次掩土培根九月初培土护根以防斫后霜雪",
        "蔗品",
        "凡荻蔗造糖有凝冰白霜红砂三品糖品之分分于蔗浆之老嫩凡蔗性至秋渐转红黑色冬至以后由红转褐以成至白五岭以南无霜国土蓄蔗不伐以取糖霜若韶雄以北十月霜侵蔗质遇霜即杀其身不能久待以成白色故速伐以取红糖也凡取红糖穷十日之力而为之十日以前其浆尚未满足十日以后恐霜气逼侵前功尽弃故种蔗十亩之家即制车釜一付以供急用若广南无霜迟早惟人也",
        "造糖　具图",
        "凡造糖车制用横板二片长五尺厚五寸阔二尺两头凿眼安柱上┺出少许下┺出板二三尺埋筑土内使安稳不摇上板中凿二眼并列巨轴两根木用至坚重者轴木大七尺围方妙两轴一长三尺一长四尺五寸其长者出┺安犁担担用屈木长一丈五尺以便驾牛团转走轴上凿齿分配雌雄其合缝处须直而圆圆而缝合夹蔗于中一轧而过与棉花赶车同义蔗过浆流再拾其滓向轴上鸭嘴扌及入再轧又三轧之其汁尽矣其滓为薪其下板承轴凿眼只深一寸五分使轴脚不穿透以便板上受汁也其轴脚嵌安铁锭于中以便捩转",
        "凡汁浆流板有槽枧汁入于缸内每汁一石下石灰五合于中凡取汁煎糖并列三锅如“品”字先将稠汁聚入一锅然后逐加稀汁两锅之内若火力少束薪其糖即成顽糖起沫不中用",
        "造白糖",
        "凡闽广南方经冬老蔗用车同前法榨汁入缸看水花为火色其花煎至细嫩如煮羹沸以手捻试粘手则信来矣此时尚黄黑色将桶盛贮凝成黑沙然后以瓦溜教陶家烧造置缸上共溜上宽下尖底有一小孔将草塞住倾桶中黑沙于内待黑沙结定然后去孔中塞草用黄泥水淋下其中黑滓入缸内溜内尽成白霜最上一层厚五寸许洁白异常名曰洋糖西洋糖绝白美故名下者稍黄褐",
        "造冰糖者将洋糖煎化蛋青澄去浮滓候视火色将新青竹破成篾片寸斩撒入其中经过一霄即成天然冰块造狮象人物等质料精粗由人凡白糖有五品石山为上团枝次之瓮鉴次之小颗又次沙脚为下",
        "饴饧",
        "凡饴饧稻麦黍粟皆可为之洪范云“稼穑作甘”及此乃穷其理其法用稻麦之类浸湿生芽暴干然后煎炼调化而成色以白者为上赤色者名曰胶饴一时宫中尚之含于口内即溶化形如琥珀南方造饼饵者谓饴饧为小糖盖对蔗浆而得名也饴饧人巧千方以供甘旨不可枚述惟尚方用者名“一窝丝”或流传后代不可知也",
        "蜂蜜",
        "凡酿蜜蜂普天皆有唯蔗盛之乡则蜜蜂自然减少蜂造之蜜出山岩土穴者十居其八而人家招蜂造酿而割取者十居其二也凡蜜无定色或青或白或黄或褐皆随方土花性而变如菜花蜜禾花蜜之类百千其名不止也",
        "凡蜂不论于家于野皆有蜂王王之所居造一台如桃大王之子世为王王生而不采花每日群蜂轮值分班采花供王王每日出游两度春夏造蜜时游则八蜂轮值以待蜂王自至孔隙口四蜂以头顶腹四蜂傍翼飞翔而去游数刻而返翼顶如前",
        "畜家蜂者或悬桶檐端或置箱牖下皆锥圆孔眼数十俟其进入凡家人杀一蜂二蜂皆无恙杀至三蜂则群起螫人谓之蜂反凡蝙蝠最喜食蜂投隙入中吞噬无限杀一蝙蝠悬于蜂前则不敢食俗谓之枭令凡家蓄蜂东邻分而之西舍必分王之子去而为君去时如铺扇拥卫乡人有撒洒糟香而招之者",
        "凡蜂酿蜜造成蜜脾其形鬣鬣然咀嚼花心汁吐积而成润以人小遗则甘芳并至所谓臭腐神奇也凡割脾取蜜蜂子多死其中其底则为黄蜡凡深山崖石上有经数载未割者其蜜已经时自熟土人以长竿刺取蜜即流下或未经年而攀缘可取者割炼与家蜜同也土穴所酿多出北方南方卑湿有崖蜜而无穴蜜凡蜜脾一斤炼取十二两西北半天下盖与蔗浆分胜云",
        "附造兽糖",
        "凡造兽糖者每巨釜一口受糖五十斤其下发火慢煎火从一角烧灼则糖头滚旋而起若釜心发火则尽尽沸溢于地每釜用鸡子三个去黄取清入冷水五升化解逐匙滴下用火糖头之上则浮沤黑滓尽起水面以笊篱捞去其糖清白之甚然后打入铜铫下用自风慢火温之看定火色然后入模凡狮象糖模两合如瓦为之杓写糖入随手覆转倾下模冷糖烧自有糖一膜靠模凝结名曰享糖华筵用之"
      ]
    },
    {
      "title": "陶埏",
      "content": [
        "宋子曰水火既济而土合万室之国日勤千有而不足民用亦繁矣哉上栋下室以避风雨而瓴建焉王公设险以守其国而城垣雉堞寇来不可上矣泥瓮坚而醴酒欲清瓦登洁而醯醢以荐商周之际俎豆以木为之毋亦质重之思耶后世方土效灵人工表异陶成雅器有素肌玉骨之象焉掩映几筵文明可掬岂终固哉",
        "瓦",
        "凡埏泥造瓦掘地二尺余择取无沙粘土而为之百里之内必产合用土色供人居室之用凡民居瓦形皆四合分片先以圆桶为模骨外画四条界调践熟泥叠成高长方条然后用铁线弦弓线上空三分以尺限定向泥{一个}平戛一片似揭纸而起周包圆桶之上待其稍干脱模而出自然裂为四片凡瓦大小古无定式大者纵横八九寸小者缩十之三室宇合沟中则必需其最大者名曰沟瓦能承受淫雨不溢漏也",
        "凡坯既成干燥之后则堆积窑中燃薪举火或一昼夜或二昼夜视窑中多少为熄火久暂浇水转氵幼音右与造砖同法其垂于檐端者有滴水不于脊沿者有云瓦瓦掩覆脊者有抱同镇脊两头者有鸟兽诸形象皆人工逐一做成载于窑内受水火而成器则一也",
        "若皇家宫殿所用大异于是其制为琉璃瓦者或为板片或为宛筒以圆竹与斫木为模逐片成造其土必取于太平府舟运三千里方达京师参沙之伪雇役掳舡之扰害不可极即承天皇陵亦取于此无人议正造成先装入琉璃窑内每柴五千斤浇瓦百片取出成色以无名异棕榈毛等煎汁涂染成绿黛赭石松香蒲草等涂染成黄再入别窑减杀薪火逼成琉璃宝色外省亲王殿与仙佛宫观间亦为之但色料各有配合采取不必尽同民居则有禁也",
        "砖",
        "凡埏泥造砖亦掘地验辨土色或蓝或白或红或黄闽广多红泥蓝者名善泥江浙居多皆以粘而不散粉而不沙者为上汲水滋土人逐数牛错趾踏成稠泥然后填满木匡之中铁线弓戛平其面而成坯形",
        "凡郡邑城雉民居垣墙所用者有眠砖侧砖两色眠砖方长条砌城郭与民人饶富家不惜工费直垒而上民居算计者则一眠之上施侧砖一路填土砾其中以实之盖省啬之义也凡墙砖而外地者名曰方墁砖榱桷上用以承瓦者曰皇板砖圆鞠小桥梁与圭门与窀穸墓穴者曰刀砖又曰鞠砖凡刀砖削狭一偏面相靠挤紧上砌成圆车马践压不能损陷",
        "造方墁砖泥入方匡中平板盖面两人足立其上研转而坚固之浇成效用石工磨斫四沿然后地刀砖之直视墙砖稍溢一分皇板砖则积十以当墙砖之一方墁砖则一以敌墙砖之十也",
        "凡砖成坯之后装入窑中所装百钧则火力一昼夜二百钧则倍时而足凡烧砖有柴薪窑有煤炭窑用薪者出火成青黑色用煤者出火成白色凡柴薪窑巅上偏侧凿三孔以出烟火足止薪之候泥固塞其孔然后使水转氵幼凡火候少一两则氵幼色不光少三两则名嫩火砖本色杂现他日经霜冒雪则立成解散仍还土质火候多一两则砖面有裂纹多三两则砖形缩小拆裂屈曲不伸击之如碎铁然不适于用巧用者以之埋藏土内为墙脚则亦有砖之用也凡观火候从窑门透视内壁土受火精形神摇荡若金银熔化之极然陶长辨之",
        "凡转氵幼之法窑巅作一平田样四围稍弦起灌水其上砖瓦百钧用水四十石水神透入土膜之下与火意相感而成水火既济其质千秋矣若煤炭窑视柴窑深欲倍之其上圆鞠渐小并不封顶其内以煤造成尺五径阔饼每煤一层隔砖一层苇薪垫地发火",
        "若皇居所用砖其大者厂在临清工部分司主之初名色有副砖券砖平身砖望板砖斧刃砖方砖之类后革去半运至京师每漕舫搭四十块民舟半之又细料方砖以正殿者则由苏州造解其琉璃砖色料已载瓦款取薪台基厂烧由黑窑云",
        "罂瓮",
        "凡陶家为缶属其类百千大者缸瓮中者钵孟小者瓶罐款制各从方土悉数之不能造此者必为圆而不方之器试土寻泥之后仍制陶车旋盘工夫精熟者视器大小掐泥不甚增多少两人扶泥旋转一捏而就其朝迁所用龙凤缸窑在真定曲阳与扬州仪真与南直花缸则厚积其泥以俟雕镂作法全不相同故其直或百倍或五十倍也",
        "凡罂缶有耳嘴者皆另为合上以氵幼水涂粘陶器皆有底无底者则陕以西炊甑用瓦不用木也凡诸陶器精者中外皆过釉粗者或釉其半体惟沙盆齿钵之类其中不釉存其粗涩以受研擂之功沙锅沙罐不釉利于透火性以熟烹也",
        "凡釉质料随地而生江浙闽广用者蕨蓝草一味其草乃居民供灶之薪长不过三尺枝叶似杉木勒而不棘人其名数十各地不同陶家取来燃灰布袋灌水澄滤去其粗者取其绝细每灰二碗参以红土泥水一碗搅令极匀蘸涂坯上烧出自成光色北方未详用何物苏州黄罐釉亦别有料惟上用龙凤器则仍用松香与无名异也",
        "凡瓶窑烧小器缸窑烧大器山西浙江省分缸窑瓶窑余省则合一处为之凡造敞口缸旋成两截接合处以木椎内外打紧匝口坛瓮亦两截接合不便用椎预于别窑烧成瓦圈如金刚圈形托印其内外以木椎打紧土性自合",
        "凡缸瓶窑不于平地必于斜阜山冈之上延长者或二三十丈短者亦十余丈连接为数十窑皆一窑高一级盖依傍山势所以驱流水湿滋之患而火气又循级透上其数十方成窑者其中苦无重值物合并众力众资而为之也其窑鞠成之后上铺覆以绝细土厚三寸许窑隔五尺许则透烟窗窑门两边相向而开装物以至小器装载头一低窑绝大缸瓮装在最末尾高窑发火先从头一低窑起两人对面交看火色大抵陶器一百三十费薪百斤火候足时掩闭其门然后次发第二火以次结竟至尾云",
        "白瓷　附青瓷",
        "凡白土曰垩土为陶家精美器用中国出惟五六处北则真定定州平凉华亭太原平定开封禹州南则泉郡德化土出永定窑在德化徽郡婺源祁门他处白土陶范不粘或以扫壁为墁德化窑惟以烧造瓷仙精巧人物玩器不适实用真开等郡瓷窑所出色或黄滞无宝光合并数郡不敌江西饶郡产浙省处州丽水龙泉两邑烧造过釉杯碗青黑如漆名曰处窑宋元时龙泉琉山下有章氏造窑出款贵重古董行所谓哥窑器者即此",
        "若夫中华四裔驰名猎取者皆饶郡浮梁景德镇之产也此镇从古及今为烧器地然不产白土土出婺源祁门两山一名高梁山出粳米土其性坚硬一名开化山出糯米土其性粢软两土和合瓷器方成其土作成方块小舟运至镇造器者将两土等分入臼舂一日然后入缸水澄其上浮者为细料倾跌过一缸其下沉底者为粗料细料缸中再取上浮者倾过为最细料沉底者为中料既澄之后以砖砌方长塘逼靠火窑以借火力倾所澄之泥于中吸干然后重用清水调和造坯",
        "凡造瓷坯有两种一曰印器如方圆不等瓶瓮炉合之类御器则有瓷屏风烛台之类先以黄泥塑成模印或两破或两截亦或囫囵然后埏白泥印成以釉水涂合其缝浇出时自圆成无隙一曰圆器凡大小亿万杯盘之类乃生人日用必需造者居十九而印器则十一造此器坯先制陶车车竖直木一根埋三尺入土内使之安稳上高二尺许上下列圆盘盘沿以短竹棍拨运旋转盘顶正中用檀木刻成盔头冒其上",
        "凡造杯盘无有定形模式以两手棒泥盔冒之上旋盘使转拇指剪去甲按定泥底就大指薄旋而上即成一杯碗之形初学者任从作废破坯取泥再造功多业熟即千万如出一范凡盔冒上造小杯者不必加泥造中盘大碗则增泥大其冒使干燥而后受功凡手指旋成坯后覆转用盔冒一印微晒留滋润又一印晒成极白干入水一汶漉上盔冒过利刀二次过刀时手脉微振烧出即成雀口然后补整碎缺就车上旋转打圈圈后或画或书字画后喷水数口然后过釉",
        "凡为碎器与千钟粟与褐色杯等不用青料欲为碎器利刀过后日晒极热入清水一蘸而起烧出自成裂纹千钟粟则釉浆捷点褐色则老茶叶煎水一抹也古碎器日本国极珍重真者不惜千金古香炉碎器不知何代造底有铁钉其钉掩光色不锈",
        "凡饶镇白瓷釉用小港嘴泥浆和桃竹叶灰调成似清泔汁泉郡瓷仙用松毛水调泥浆处郡青瓷釉未详所出盛于缸内凡诸器过釉先荡其内外边用指一蘸涂弦自然流遍凡画碗青料总一味无名异漆匠煎油亦用以收火色此物不生深土浮生地面深者掘下三尺即止各省直皆有之亦辨认上料中料下料用时先将炭火丛红煅过上者出火成翠毛色中者微青下者近土褐上者每斤煅出只得七两中下者以次缩减如上品细料器及御器龙凤等皆以上料画成故其价每石值银二十四两中者半之下者则十之三而已",
        "凡饶镇所用以衢信两郡山中者为上料名曰浙料上高诸邑者为中丰城诸处者为下也凡使料煅过之后以乳钵极研其钵底留粗不转釉然后调画水调研时色如皂入火则成青碧色凡将碎器为紫霞色杯者用胭脂打湿将铁线纽一兜络盛碎器其中炭火炙热然后以湿胭脂一抹即成凡宣红器乃烧成之后出火另施工巧微炙而成者非世上殊砂能留红质于火内也宣红元末已失传正德中历试复造出",
        "凡瓷器经画过釉之后装入匣钵装时手拿微重后日烧出即成坳口不复周正钵以粗泥造其中一泥饼托一器底空处以沙实之大器一匣装一个小器十余共一匣钵钵佳者装烧十余度劣者一二次即坏凡匣钵装器入窑然后举火其窑上空十二圆眼名曰天窗火以十二时辰为足先发门火十个时火力从下攻上然后天窗掷柴烧两时火力从上透下器在火中其软如棉絮以铁叉取一以验火候之足辨认真足然后绝薪止火共计一坯工力过手七十二方克成器其中微细节目尚不能尽也",
        "附窑变　回青",
        "正德中内使监造御器时宣红失传不成身家俱丧一人跃入自焚托梦他人造出竞传窑变好异者遂妄传烧出鹿象诸异物也又回青乃西域大青美者亦名佛头青上料无名异出火似之非大青能入洪炉存本色也"
      ]
    },
    {
      "title": "冶铸",
      "content": [
        "宋子曰首山之采肇自轩辕源流远矣哉九牧贡金用襄禹鼎从此火金功用日异而月新矣夫金之生也以土为母及其成形而效用于世也母模子肖亦犹是焉精粗巨细之间但见钝者司舂利者司垦薄其身以媒合水火而百姓繁虚其腹以振荡空灵而八音起愿者肖仙梵之身而尘凡有至象巧者夺上清之魄而海宇遍流泉即屈指唱筹岂能悉数要之人力不至于此",
        "鼎",
        "凡铸鼎唐虞以前不可考唯禹铸九鼎则因九州贡赋壤则已成入贡方物岁例已定疏浚河道已通禹贡业已成书恐后世人君增赋重敛后代侯国冒贡奇淫后日治水之人不由其道故铸之于鼎不如书籍之易去使有所遵守不可移易此九鼎所为铸也年代久远末学寡闻如珠暨鱼狐狸织皮之类皆其刻画于鼎上者或漫灭改形未可知陋者遂以为怪物故春秋传有使知神奸不逢魑魅之说也此鼎入秦始亡而春秋时郜大鼎莒二方鼎皆其列国自造即有刻画必失禹贡初旨此但存名为古物后世图籍繁多百倍上古亦不复铸鼎特并志之",
        "钟",
        "凡钟为金乐之首其声一宣大者闻十里小者亦及里之余故君视朝官出署必用以集众而乡饮酒礼必用以和歌梵宫仙殿必用以明摄谒者之城幽起鬼神之敬",
        "凡铸钟高者铜质下者铁质今北极朝钟则纯用响铜每口共费铜四万七千斤锡四千斤金五十两银一百二十两于内成器亦重二万斤身高一丈一尺五寸双龙蒲牢高二尺七寸口径八尺则今朝钟之制也",
        "凡造万钧钟与铸鼎法同掘坑深丈几尺燥筑其中如房舍埏泥作模骨用石灰三和土筑不使有丝毫隙拆干燥之后以牛油黄蜡附其上数寸油蜡分两油居什八蜡居什二其上高蔽抵晴雨夏月不可为油不冻结油蜡墁定然后雕镂书文物象丝发成就然后舂筛绝细土与炭末为泥涂墁以渐而加厚至数寸使其内外透体干坚外施火力炙化其中油蜡从口上孔隙熔流净尽则其中空处即钟鼎托体之区也",
        "凡油蜡一斤虚位填铜十斤塑油时尽油十斤则备铜百斤以俟之中既空净则议熔铜凡火铜至万钧非手足所能驱使四面筑炉四面泥作槽道其道上口承接炉中下口斜低以就钟鼎入铜孔槽傍一齐红炭织围洪炉熔化时决开槽梗先泥土为梗塞住一齐如水横流从槽道中枧注而下钟鼎成矣凡万钧铁钟与炉釜其法皆同而塑法则由人省啬也若千斤以内者则不须如此劳费但多捏十数锅炉炉形如箕铁条作骨附泥做就其下先以铁片圈筒直透作两孔以受杠穿其炉垫于土墩之上各炉一齐鼓鞲熔化化后以两杠穿炉下轻者两人重者数人抬起倾注模底孔中甲炉既倾乙炉疾继之丙炉又疾继之其中自然粘合若相承迂缓则先入之质欲冻后者不粘衅所由生也",
        "凡铁钟模不重费油蜡者先埏土作外模剖破两边形或为两截以子口串合翻刻书文于其上内模缩小分寸空其中体精美而就外模刻文后以牛油滑之使他日器无粘然后盖上泥合其缝而受铸焉巨磬云板法皆仿此",
        "釜",
        "凡釜储水受火日用司命系焉铸用生铁或废铸铁器为质大小无定式常用者径口二尺为率厚约二分小者径口半之厚薄不减其模内外为两层先塑其内俟久日干燥合釜形分寸于上然后塑外层盖模此塑匠最精差之毫厘则无用",
        "模既成就干燥然后泥捏冶炉其中如釜受生铁于中其炉背透管通风炉面捏嘴出铁一炉所化约十釜二十釜之料铁化如水以泥固纯铁柄杓从嘴受注一杓约一釜之料倾注模底孔内不俟冷定即揭开盖模看视罅绽未周之处此时釜身尚通红未黑有不到处即浇少许于上补完打湿草片按平若无痕迹",
        "凡生铁初铸釜补绽者甚多唯废破釜铁熔铸则无复隙漏朝鲜国俗破釜必弃之山中不以还炉凡釜既成后试法以轻杖敲之响声如木者佳声有差响则铁质未熟之故他日易为损坏海内丛林大处铸有千僧锅者煮糜受米二石此真痴物也",
        "像",
        "凡铸仙佛铜像塑法与朝钟同但钟鼎不可接而像则数接为之故写时为力甚易但接模之法分寸最精云",
        "炮",
        "凡铸炮西洋红夷佛郎机等用熟铜造信炮短提铳等用生熟铜兼半造襄阳盏口大将军二将军等用铁造",
        "镜",
        "凡铸镜模用灰沙铜用锡和不用倭铅考工记亦云“金锡相半渭之鉴燧之剂”开面成光则水银附体而成非铜有光明如许也唐开元宫中镜尽以白银与铜等分铸成每口值银数两者以此故朱砂斑点乃金银精华发现古炉有入金于内者我朝宣炉亦缘某库偶灾金银杂铜锡化作一团命以铸炉真者错现金色唐镜宣炉皆朝廷盛世物云",
        "钱",
        "凡铸铜为钱以利民用一面刊国号通宝四字工部分司主之凡钱通利者以十文抵银一分值其大钱当五当十其弊便于私铸反以害民故中外行而辄不行也",
        "凡铸钱每十斤红铜居六七倭铅京中名水锡居三四此等分大略倭铅每见烈火必耗四分之一我朝行用钱高色者唯北京宝源局黄钱与广东高州炉青钱高州钱行盛漳泉路其价一文敌南直江浙等二文黄钱又分二等四火铜所铸曰金背钱二火铜所铸曰火漆钱",
        "凡铸钱熔铜之罐以绝细土末打碎干土砖妙和炭末为之京炉用牛蹄甲未详何作用罐料十两土居七而炭居三以炭灰性暖佐土使易化物也罐长八寸口径二寸五分一罐约载铜铅十斤铜先入化然后投铅洪沪扇合倾入模内",
        "凡铸钱模以木四条为空匡木长一尺一寸阔一寸二分土炭末筛令极细填实匡中微洒杉木炭灰或柳木炭灰于其面上或熏模则用松香与清油然后以母百文用锡雕成或字或背布置其上又用一匡如前法填实合盖之既合之后已成面背两匡随手覆转则母钱尽落后匡之上又用一匡填实合上后匡如是转覆只合十余匡然后以绳捆定其木匡上弦原留入铜眼孔铸工用鹰嘴钳洪炉提出熔罐一人以别钳扶抬罐底相助逐一倾入孔中冷定解绳开匡则磊落百丈如花果附枝模中原印空梗走铜如树枝样挟出逐一摘断以待磨钅差成钱凡钱先错边沿以竹木条直贯数百文受钅差后钅差平面则逐一为之",
        "凡钱高低以铅多寡分其厚重与薄削则昭然易见铅贱铜贵私铸者至对半为之以之掷阶石上声如木石者此低钱也若高钱铜九铅一则掷地作金声矣凡将成器废铜铸钱者每火十耗其一盖铅质先走其铜色渐高胜于新铜初化者若琉球诸国银钱其模即凿锲铁钳头上银化之时入锅夹取淬于冷水之中即落一钱其内图并具后",
        "附铁钱",
        "铁质贱甚从古无铸钱起于唐藩镇魏博诸地铜货不通始冶为之盖斯须之计也皇家盛时则冶银为豆杂伯衰时则铸铁为钱并志博物者感慨"
      ]
    },
    {
      "title": "舟车",
      "content": [
        "宋子曰人群分而物异产来往懋迁以成宇宙若各居而老死何藉有群类哉人有贵而必出行畏周行物有贱而必须坐穷负贩四海之内南资舟而北资车梯航万国能使帝京元气充然何其始造舟车者不食尸祝之报也浮海长年视万顷波如平地此与列子所谓御泠风者无异传所称奚仲之流倘所谓神人者非耶",
        "舟",
        "凡舟古名百千今名亦百千或以形名如海鳅江鳊山梭之类或以量名载物之数或以质名各色木料不可殚述游海滨者得见洋船居江湄者得见漕舫若局趣山国之中老死平原之地所见者一叶扁舟截流乱筏而已粗载数舟制度其余可例推云",
        "漕舫",
        "凡京师为军民集区万国水运以供储漕舫所由兴也元朝混一以燕京为大都南方运道由苏州刘家港海门黄连沙开洋直抵天津制度用遮洋船永乐间因之以风涛多险后改漕运",
        "平江伯陈某始造平底浅船则今粮船之制也凡船制底为地枋为宫墙阴阳竹为覆瓦伏狮前为阀阅后为寝堂桅为弓弩弦篷为翼橹为车马{}纤为履鞋纟聿索为鹰雕筋骨招为先锋舵为指挥主帅锚为扎车营寨",
        "粮船初制底长五丈二尺其板厚二寸采巨木楠为上栗次之头长九尺五寸梢长九尺五寸底阔九尺五寸底头阔六尺底梢阔五尺头伏狮阔八尺梢伏狮阔七尺梁头一十四座龙口梁阔一丈深四尺使风梁阔一丈四尺深三尺八寸后断水梁阔九尺深四尺五寸两廒共阔七尺六寸此其初制载米可近二千石交兑每只止足五百石",
        "后运军造者私增身长二丈首尾阔二尺余其量可受三千石而运河闸口原阔一丈二尺差可度过凡今官坐船其制尽同第窗户之间宽其出径加以精工彩饰而已",
        "凡造船先从底起底面傍靠樯上承栈下亲地面隔位列置者曰梁两傍峻立者曰樯盖樯巨木曰正枋枋上曰弦梁前竖桅位曰锚坛坛底横木夹桅本者曰地龙前后维曰伏狮其下曰拿狮伏狮下封头木曰连三枋船头面中缺一方曰水井其下藏缆索等物头面眉际树两木以系缆者曰将车柱船尾下斜上者曰草鞋底后封头下曰短枋枋下曰挽脚梁船梢掌舵所居其上者野鸡篷使风时一人坐篷巅收守篷索",
        "凡舟身将十丈者立桅必两树中桅之位折中过前二位头桅又前丈余粮船中桅长者以八丈为率短者缩十之一二其本入窗内亦丈余悬篷之位约五六丈头桅尺寸则不及中桅之半篷纵横亦不敌三分之一苏湖六郡运米其船多过石瓮桥下且无江汉之险故桅与篷尺寸全杀若湖广江西省舟则过湖冲江无端风浪故锚缆篷桅必极尽制度而后无患凡风篷尺寸其则一视全舟横身过则有患不及则力软",
        "凡船篷其质乃析篾成片织就夹维竹条逐块折叠以俟悬挂粮船中桅篷合并十人力方克凑顶头篷则两人带之有余凡度篷索先系空中寸圆木关捩于桅巅之上然后带索腰间缘木而上三股交错而度之凡风篷之力其末一叶敌其本三叶调匀和畅顺风则绝顶张篷行疾奔马若风力氵存至则以次减下遇风鼓急不下以钩搭扯狂甚则只带一两叶而已",
        "凡风从横来名曰抢风顺水行舟则挂篷之玄游走或一抢向东止寸平过甚至却退数十丈未及岸时捩舵转篷一抢向西借贷水力兼带风力轧下则顷刻十余里或湖水平而不流者亦可缓轧若上水舟则一步不可行也凡船性随水若草从风故制舵障水使不定向流舵板一转一泓从之",
        "凡舵尺寸与船腹切齐其长一寸则遇浅之时船腹已过其梢尼舵使胶住设风狂力劲则寸木为难不可言舵短一寸则转运力怯回头不捷凡舵力所障水相应及船头而止其腹底之下俨若一派急顺流故船头不约而正其机妙不可言",
        "舵上所操柄名曰关门棒欲船北则南向捩转欲船南则北向捩转船身太长而风力横劲舵力不甚应手则急下一偏披水板以抵其势凡舵用直木一根粮船用者围三尺长丈余为身上截衡受棒下截界开衔口纳板其中如斧形铁钉固拴以障水梢后隆起处亦名曰舵楼",
        "凡铁锚所以沉水系舟一粮船计用五六锚最雄者曰看家锚重五百斤内外其余头用二枝梢用二枝凡中流遇逆风不可去又不可泊或业已近岸其下有石非沙亦不可泊惟打锚深处则下锚沉水底其所系纟聿缠绕将军柱上锚爪一遇泥沙扣底抓住十分危急则下看家锚系此锚者名曰本身盖重言之也或同行前舟阻滞恐我舟顺势急去有撞伤之祸则急下梢锚提住使不迅速流行风息开舟则以云车纹缆提锚使上",
        "凡船板合隙缝以白麻斫絮为筋钝凿扌及入然后筛过细石灰和桐油舂杵成团调念温台闽广即用蛎灰凡舟中带篷索以火麻秸一名大麻绞粗成径寸以外者即系万钧不绝若系锚缆则破析青篾为之其篾线入釜煮熟然后纠绞拽缱{}亦煮熟篾线绞成十丈以往中作圈为接区遇阻碍可以掐断凡竹性直篾一线千钧三峡入川上水舟不用纠绞{}缱即破竹阔寸许者整条以次接长名曰火杖盖沿崖石棱如刃惧破篾易损也",
        "凡木色桅用端直杉木长不足则接其表铁箍逐寸包围船窗前道皆当中空阙以便树桅凡树中桅合并数巨舟承载其未长缆系表而起梁与枋樯用楠木槠木樟木榆木槐木樟木春夏伐者久则粉蛀栈板不拘何木舵杆用榆木榔木槠木关门棒用周木榔木橹用杉木桧木楸木此其大端云",
        "海舟",
        "凡海舟元朝与国初运米者曰遮洋浅船次者曰钻风船即海鳅所经道里止万里长滩黑水洋沙门岛等处皆无大险与出使琉球日本暨商贾爪哇笃泥等船制度工费不及十分之一",
        "凡遮洋运船制视漕船长一丈六尺阔二尺五寸器具皆同唯舵杆必用铁力木念灰用鱼油和桐油不知何义凡外国海舶制度大同小异闽广闽由海澄开洋广由香奥洋船截竹两破排栅树于两傍以抵浪登莱制度又不然倭国海舶两傍列橹手栏板抵水人在其中运力朝鲜制度又不然",
        "至其首尾各安罗经盘以定方向中腰大横梁出头数尺贯插腰舵则皆同也腰舵非与梢舵形同乃阔板斫成刀形插入水中亦不捩转盖夹卫扶倾之义其上仍横柄栓于梁上而遇浅则提起有似乎舵故名腰舵也凡海舟以竹筒贮淡水数石度供舟内人两日之需遇岛又汲其何国何岛合用何向针指示昭然恐非人力所祖舵工一群主佐直是识力造到死生浑忘地非鼓勇之谓也",
        "杂舟",
        "江汉课船身甚狭小而长上列十余仓每仓容止一人卧息首尾共桨六把小桅篷一座风涛之中恃有多桨挟持不遇逆风一昼夜顺水行四百余里逆水亦行百余里国朝盐课淮扬数颇多故设此运银名曰课船行人欲速者亦买之其船南自章贡西自荆襄达于瓜仪而止",
        "三吴浪船凡浙西平江纵横七百里内尽是深沟小水湾环浪船最小者曰塘船以万亿计其舟行人贵贱来往以代马车履舟即小者必造窗牖堂房质料多用杉木人物载其中不可偏重一石偏即欹侧故俗名天平船此舟来往七百里内或好逸便者径买北达通津只有镇江一横渡俟风静涉过又渡清江浦溯黄河浅水二百里则入闸河安稳路矣至长江上流风浪则没世避而不经也浪船行力在梢后巨橹一枝两三人推轧前走或恃缱{}至于风篷则小席如掌所不恃也",
        "东浙西安船浙东自常山至钱塘八百里水径入海不通他道故此舟自常山开化遂安等小河起至钱塘而止更无他涉舟制箬篷如卷瓦为上盖缝布为帆高可二丈许绵索张带初为布帆者原因钱塘有潮涌急时易于收下此亦未然其费似侈于篾席总不可晓",
        "福建清流梢篷船其船自光泽崇安两小河起达于福州洪塘而止其下水道皆海矣清流船以载货物客商梢篷船大差可坐卧官贵家属用之其船皆以杉木为地滩石甚险破损者其常遇损则急舣向岸搬物掩塞船梢径不用舵船首列一巨招捩头使转每帮五只方行经一险滩则四舟之人皆从尾后曳缆以缓其趋势长年即寒冬不裹足以便频濡风篷竟悬不用云",
        "四川八橹等船凡川水源通江汉然川船达荆州而止此下则更舟矣逆行而上自夷陵入峡挽缱者以巨竹破为四片或六片麻绳约接名曰火杖舟中鸣鼓若竞渡挽人从山石中闻鼓声而咸力中夏至中秋川水封峡则断绝行舟数月过此消退方通往来其新滩等数极险处人与货尽盘岸行半里许只余空舟上下其舟制腹圆而首尾尖狭所以辟滩浪云",
        "黄河满篷梢其船自河入淮自淮溯汴用之质用楠木工价颇优大小不等巨者载三千石小者五百石下水则首颈之际横压一梁巨橹两枝两傍推轧而下锚缆{}帆制与江汉相仿云",
        "广东黑楼船盐船北自南雄南达会省下此惠潮通漳泉则由海汊乘海舟矣黑楼船为官贵所乘盐船以载货物舟制两傍可行走风帆编蒲为之不挂独竿桅双柱悬帆不若中原随转逆流冯藉缱力则与各省直同功云",
        "黄河秦船俗名摆子船造作多出韩城巨者载石数万钧顺流而下供用淮徐地面舟制首尾方阔均等仓梁平下不甚隆起急流顺下巨橹两傍夹推来往不冯风力归舟挽缱多至二十余人甚有弃舟空返者",
        "车",
        "凡车利行平地古者秦晋燕齐之交列国战争必用车故千乘万乘之号起自战争国楚汉血争而后日辟南方则水战用舟陆战用步马北膺胡虏交使铁骑战车逐无所用之但今服马驾车以运重载则今日骡车即同彼时战车之义也",
        "凡骡车之制有四轮者有双轮者其上承载支架皆从轴上穿斗而起四轮者前后各横轴一根轴上短柱起架直梁梁上载箱马止脱驾之时其上平整如居屋安稳之象若两轮者驾马行时马曳其前则箱地平正脱马之时则以短木从地支撑而住不然则欹卸也",
        "凡车轮一曰辕俗名车陀其大车中毂俗名车脑长一尺五寸见小戎车注所谓外受辐中贯轴者辐计三十片其内插毂其外接辅车轮之中内集轮外接辋圆转一圈者是曰辅也辋际尽头则曰轮辕也凡大车脱时则诸物星散收藏驾则先上两轴然后以次间架凡轼衡轸轭皆从轴上受基也",
        "凡四轮大车量可载五十石骡马多者或十二挂或十挂少亦八挂执鞭掌御者居箱之中立足高处前马分为两班战车四马一班分骖服纠黄麻为长索分系马项后套总结收入衡内两旁掌御者手执长鞭鞭以麻为绳长七尺许竿身亦相等察视不力者鞭及其身箱内用二人踹绳须识马性与索性者为之马行太紧则急起踹绳否则翻车之祸从此起也凡车行时遇前途行人应避者则掌御者急以声呼则群马皆止凡马索总系透衡入箱处皆以牛皮束缚诗经所谓“胁驱”是也",
        "凡大车饲马不入肆舍车上载有柳盘解索而野食之乘车人上下皆缘小梯凡过桥梁中高边下者则十马之中择一最强力者系于车后当其下坂则九马从前缓曳一马从后竭力抓住以杀其驰趋之势不然则险道也凡大车行程遇河亦止遇山亦止遇曲径小道亦止徐兖汴梁之交或达三百里者无水之国所以济舟楫之穷也",
        "凡车质惟先择长者为轴短者为毂其木以槐枣檀榆用榔榆为上檀质太久劳则发烧有慎用者合抱枣槐其至美也其余轸衡箱轭则诸木可为耳此外牛车以载刍粮最盛晋地路逢隘道则牛颈系巨铃名曰报君知犹之骡车群马尽系铃声也",
        "又北方独辕车人推其后驴曳其前行人不耐骑坐者则雇觅之鞠席其上以蔽风日人必两旁对坐否则欹倒此车北上长安济宁径达帝京不载人者载货约重四五石而止其驾牛为轿车者独盛中州两旁双轮中穿一轴其分寸平如水横架短衡列轿其上人可安坐脱驾不欹其南方独轮推车则一人之力是视容载两石遇坎即止最远者止达百里而已其余难以枚述但生于南方者不见大车老于北方者不见巨舰故粗载之"
      ]
    },
    {
      "title": "锤锻",
      "content": [
        "宋子曰金木受攻而物象曲成世无利器即般亻垂安所施其巧哉五兵之内六乐之中微钳锤之奏功也生杀之机泯然矣同出洪炉烈火大小殊形重千钧者系巨舰于狂渊轻一羽者透绣纹于章服使冶铸鼎之巧束手而让神功焉莫邪干将双龙飞跃毋其说亦有征焉者乎",
        "治铁",
        "凡治铁成器取已炒熟铁为之先铸铁成砧以为受锤之地谚云“万器以钳为祖”非无稽之说也凡出炉熟铁名曰毛铁受锻之时十耗其三为铁华铁落若已成废器未锈烂者名曰劳铁改造他器与本器再经锤煅十止耗去其一也凡炉中炽铁用炭煤炭居十七木炭居十三凡山林无煤之处锻工先择坚硬条木烧成火墨俗名火矢扬烧不闭穴火其炎更烈于煤即用煤炭也别有铁炭一种取其火性内攻焰不虚腾者与炊炭同形而有分类也",
        "凡铁性逐节粘合涂上黄泥于接口之上入火挥槌泥滓成枵而去取其神气为媒合胶结之后非灼红斧斩永不可断也凡熟铁钢铁已经炉锤水火未济其质未坚乘其出火时入清水淬之名曰健钢健铁言乎未健之时为钢为铁弱性犹存也凡焊铁之法西洋诸国别有奇药中华小焊用白铜末大焊则竭力挥锤而强合之历岁之久终不可坚故大炮西番有锻成者中国惟恃冶铸也",
        "斤斧",
        "凡铁兵薄者为刀剑背厚而面薄者为斧斤刀剑绝美者以百炼钢包裹其外其中仍用无钢铁为骨若非钢表铁里则劲力所施即成折断其次寻常刀斧止嵌钢于其面即重价宝刀可斩钉截凡铁者经数千遭磨砺则钢尽而铁现也倭国刀背阔不及二分许架于手指之上不复欹倒不知用何锤法中国未得其传",
        "凡健刀斧皆嵌钢包钢整齐而后入水淬之其快利则又在砺石成功也凡匠斧与椎其中空管受柄处皆先打冷铁为骨名曰羊头然后热铁包裹冷者不粘自成空隙凡攻石椎日久四面皆空熔铁补满平填再用无弊",
        "锄",
        "凡治地生物用锄之属熟铁锻成熔化生铁淋口入水淬健即成刚劲每锹锄重一斤者淋生铁三钱为率少则不坚多则过刚而折",
        "鎈",
        "凡铁鎈纯钢为之未健之时钢性亦软以已健钢钅斩划成纵斜文理划时斜向入则文方成焰划后浇红退微冷入水健久用乖平入水退去健性再用钅斩划凡鎈开锯齿用茅叶鎈后用快弦鎈治铜钱用方长牵鎈锁钥之类用方条鎈治骨角用剑面鎈朱注所谓钅虑锡治木末则锥成圆眼不用纵斜文者名曰香鎈划鎈纹时用羊角末和盐醋先涂",
        "锥",
        "凡锥熟铁锤成不入钢和治书编之类用圆钻攻皮革用扁钻梓人转索通眼引钉合木者用蛇头钻其制颖上二分许一面圆一面剜入傍起两棱以便转索治铜叶用鸡心钻其通身三棱者名旋钻通身四方而末锐者名打钻",
        "锯",
        "凡锯熟铁锻成薄条不钢亦不淬健出火退烧后频加冷锤坚性用鎈开齿两头衔木为梁纠篾张开促紧使直长者刮木短者截木齿最细者截竹齿钝之时频加鎈锐而后使之",
        "刨",
        "凡刨磨砺嵌钢寸铁露刃秒忽斜出木口之面所以平木古名曰准巨者卧准露刃持木抽削名曰推刨圆桶家使之寻常用者横木为两翅手执前推梓人为细功者有起线刨刃阔二分许又刮木使极光者名蜈蚣刨一木之上衔十余小刀如蜈蚣之足",
        "凿",
        "凡凿熟铁锻成嵌钢于口其本空圆以受木柄先打铁骨为模名曰羊头杓柄同用斧从柄催入木透眼其末粗者阔寸许细者三分而止需圆眼者则制成剜凿为之",
        "锚",
        "凡舟行遇风难泊则全身系命于锚战船海船有重千钧者锤法先成四爪以次逐节接身其三百斤以内者用径尺阔砧安顿炉傍当其两端皆红掀去炉炭铁包木棍夹持上砧若千斤内外者则架木为棚多人立其上共持铁链两接锚身其末皆带巨铁圈链套提起捩转咸力锤合合药不用黄泥先取陈久壁土筛细一人频撒接口之中浑合方无微罅盖炉锤之中此物其最巨者",
        "针",
        "凡针先锤铁为细条用铁尺一根锥成线眼抽过条铁成线逐寸剪断为针先鎈其末成颖用小槌敲扁其本钢锥穿鼻复鎈其外然后入釜慢火炒熬炒后以土末入松木火矢豆豉三物罨盖下用火蒸留针二三口插于其外以试火候其外针入手捻成粉碎则其下针火候皆足然后开封入水健之凡引线成衣与刺绣者其质皆刚惟马尾刺工为冠者则用柳条软针分别之妙在于水火健法云",
        "治铜",
        "凡红铜升黄而后熔化造器用砒升者为白铜器工费倍难侈者事之凡黄铜原从炉甘石升者不退火性受锤从倭铅升者出炉退火性以受冷锤凡响铜入锡参和法具五金卷成乐器者必圆成无焊其余方圆用器走焊炙火粘合用锡末者为小焊用响铜末者为大焊碎铜为末用饭粘和打入水洗去饭铜末具存不然则撒散若焊银器则用红铜末",
        "凡锤乐器锤钲俗名锣不事先铸熔团即锤锤镯俗名铜鼓与丁宁则先铸成圆片然后受锤凡锤钲镯皆铺团于地面巨者众共挥力由小阔开就身起弦声俱从冷锤点发其铜鼓中间突起隆炮而后冷锤开声声分雌与雄则在分厘起伏之妙重数锤者其声为雄凡铜经锤之后色成哑白受鎈复现黄光经锤折耗铁损其十者铜只去其一气腥而色美故锤工亦贵重铁工一等云"
      ]
    },
    {
      "title": "燔石",
      "content": [
        "宋子曰五行之内土为万物之母子之贵者岂惟五金哉金与水相守而流功用谓莫尚焉矣石得燔而成功盖愈出而愈奇焉水浸淫而败物有隙必攻所谓不遗丝发者调和一物以为外拒漂海则冲洋澜粘则固城雉不烦历候远涉而至宝得焉燔石之功殆莫之与京矣至于矾现五金色之形硫为群石之将皆变化于烈火巧极丹铅炉火方士纵焦劳唇舌何尝肖像天工之万一哉",
        "石灰",
        "凡石灰经火焚炼为用成质之后入水永劫不坏亿万舟楫亿万垣墙窒隙防淫是必由之百里内外土中必生可燔石石以青色为上黄白次之石必掩土内二三尺掘取受燔土面见风者不用燔灰火料煤炭居什九薪炭居什一先取煤炭泥和做成饼每煤饼一层叠石一层铺薪其底灼火燔之最佳者曰矿灰最恶者曰窑滓灰火力到后烧酥石性置于风中久自吹化成粉急用者以水沃之亦自解散",
        "凡灰用以固舟缝则桐油鱼油调厚绢细罗和油杵千下塞念用以砌墙石则筛去石块水调粘合墁则仍用油灰用以垩墙壁则澄过入纸筋涂墁用以襄墓及贮水池则灰一分入河沙黄土二分用糯粳米羊桃藤汁和匀轻筑坚固永不隳坏名曰三和土其余造淀造纸功用难以枚述凡温台闽广海滨石不堪灰者则天生蛎蚝以代之",
        "蛎灰",
        "凡海滨石山傍水处咸浪积压生出蛎房闽中曰蚝房经年久者长成数丈阔则数亩崎岖如石假山形象蛤之类压入岩中久则消化作肉团名曰蛎黄味极珍美凡燔蛎灰者执椎与凿濡足取来药铺所货牡蛎即此碎块叠煤架火燔成与前石灰共法粘砌成墙桥梁调和桐油造舟功皆相同有误以蚬灰即蛤粉为蛎灰者不格物之故也",
        "煤炭",
        "凡煤炭普天皆生以供锻炼金石之用南方秃山无草木者下即有煤北方勿论煤有三种有明煤碎煤末煤明煤大块如斗许燕齐秦晋生之不用风箱鼓扇以木炭少许引燃炽达昼夜其傍夹带碎屑则用洁净黄土调水作饼而烧之碎煤有两种多生吴楚炎高者曰饭炭用以炊烹炎平者曰铁炭用以治锻入炉先用水沃湿必用鼓鞲后红以次增添而用末煤如面者名曰自来风泥水调成饼入于炉内既灼之后与明煤相同经昼夜不灭半供炊爨半供熔铜化石升朱至于燔石为灰与矾硫则三煤皆可用也",
        "凡取煤经历久者从土面能辨有无之色然后掘挖深至五丈许方始得煤初见煤端时毒气灼人有将巨竹凿去中节尖锐其末插入炭中其毒烟从竹中透上人从其下施拾取者或一井而下炭纵横广有则随其左右阔取其上枝板以防压崩耳",
        "凡煤炭取空而后以土填实其井以二三十年后其下煤复生长取之不尽其底及四周石卵土人名曰铜炭者取出烧皂矾与硫黄详见后款凡石卵单取硫黄者其气薰甚名曰臭煤燕京房山固安湖广荆州等处间有之凡煤炭经焚而后质随火神化去总无灰滓盖金与土石之间造化别现此种云凡煤炭不生茂草盛木之乡以见天心之妙其炊爨功用所不及者唯结腐一种而已结豆腐者用煤炉则焦苦",
        "矾石　白矾",
        "凡矾燔石而成白矾一种亦所在有之最盛者山西晋南直无为等州值价低贱与寒水石相仿然煎水极沸投矾化之以之染物则固结肤膜之间外水永不入故制糖饯与染画纸红纸者需之其末干撒又能冶浸淫恶水故湿疮家亦急需之也",
        "凡白矾掘土取磊块石层叠煤炭饼锻炼如烧石灰样火候已足冷定入水煎水极沸时盘中有溅溢如物飞出俗名蝴蝶矾者则矾成矣煎浓之后入水缸内澄其上隆结曰吊矾洁白异常其沉下者曰缸矾轻虚如棉絮者曰柳絮矾烧汁至尽白如雪者谓之巴石方药家锻过用者曰枯矾云",
        "青矾　红矾　黄矾　胆矾",
        "凡皂红黄矾皆出一种而成变化其质取煤炭外矿石俗名铜炭子每五百斤入炉炉内用煤炭饼自来风不用鼓鞲者千余斤周围包裹此石炉外砌筑土墙圈围炉巅空一圆孔如茶碗口大透炎直上孔傍以矾滓厚罨此滓不知起自何世欲作新炉者非旧滓罨盖则不成然后从底发火此火度经十日方熄其孔眼时有金色光直上取硫详后款",
        "锻经十日后冷定取出半酥杂碎者另拣出名曰时矾为煎矾红用其中清淬如矿灰形者取入缸中浸三个时漉入釜中煎炼每水十石煎至一石火候方足煎干之后上结者皆佳好皂矾下者为矾滓后炉用此盖此皂矾染家必需用中国煎者亦惟五六所原石五百斤成皂矾二百斤其大端也其拣出时矾俗又名鸡屎矾每斤入黄土四两入罐熬炼则成矾红圬墁及油漆家用之",
        "其黄矾所出又奇甚乃即炼皂矾炉侧土墙春夏经受火石精气至霜降立冬之交冷静之时其墙上自然爆出此种如淮北砖墙生焰硝样刮取下来名曰黄矾染家用之金色淡者涂炙立成紫赤也其黄矾自外国来打破中有金丝者名曰波斯矾别是一种",
        "又山陕烧取硫黄山上其滓弃地二三年后雨水浸淋精液流入沟麓之中自然结成皂矾取而货用不假煎炼其中色佳者人取以混石胆云",
        "石胆一名胆矾者亦出晋隰等州乃山石穴中自结成者故绿色带宝光烧铁器淬于胆矾水中即成铜色也",
        "本草载矾虽五种并未分别原委其昆仑矾状如黑泥铁矾状如赤石脂者皆西域产也",
        "硫黄",
        "凡硫黄乃烧石承液而结就著书者误以焚石为矾石逐有矾液之说然烧取硫黄石半出特生白石半出煤矿烧矾石此矾液之说所由混也",
        "又言中国有温泉处必有硫黄今东海广南产硫黄处又无温泉此因温泉水气似硫黄故意度言之也",
        "凡烧硫黄石与煤矿石同形掘取其石用煤炭饼包裹丛架外筑土作炉炭与石皆载千斤于内炉上用烧硫旧渣罨盖中顶隆起透一圆孔其中火力到时孔内透出黄焰金光先教陶家烧一钵盂其盂当中隆起边弦卷成鱼袋样覆于孔上石精感受火神化出黄光飞走遇盂掩住不能上飞则化成汁液靠着盂底其液流入弦袋之中其弦又透小眼流入冷道灰槽小池则凝结而成硫黄矣",
        "其炭煤矿石浇取皂矾者当其黄光上走时仍用此法掩盖以取硫黄得硫一斤则减去皂矾三十余斤其矾精华已结硫黄则枯滓逐为弃物",
        "凡火药硫为纯阳硝为纯阴两精逼合成声成变此乾坤幻出神物也",
        "硫黄不产北狄或产而不知炼取亦不可知至奇炮出于西洋与红夷则东徂西数万里皆产硫黄之地也其琉球土硫黄广南水硫黄皆误纪也",
        "砒石",
        "凡烧砒霜质料似土而坚似石而碎穴土数尺而取之江西信郡河南信阳州皆有砒井故名信石近则出产独盛衡阳一厂有造至万钧者凡砒石井中其上常有浊绿水先绞水尽然后下凿砒有红白两种各因所出原石色烧成",
        "凡烧砒下鞠土窑纳石其上上砌曲突以铁釜倒悬覆突口其下灼炭举火其烟气从曲突内熏贴釜上度其已贴一层厚结寸许下复息火待前烟冷定又举次火熏贴如前一釜之内数层已满然后提下毁釜而取砒故今砒底有铁沙即破釜滓也凡白砒止此一法红砒则分金炉内银铜脑气有闪成者",
        "凡烧砒时立者必于上风十余丈外下风所近草木皆死烧砒之人经两载即改徙否则须发尽落此物生人食过分厘立死然每岁千万金钱速售不滞者以晋地菽麦必用拌种且驱田中黄鼠害宁绍郡稻田必用蘸秧根则丰收也不然火药与染铜需用能几何哉"
      ]
    },
    {
      "title": "膏液",
      "content": [
        "宋子曰天道平分昼夜而人工继晷以襄事岂好劳而恶逸哉使织女燃薪书生映雪所济成何事也草木之实其中韫藏膏液而不能自流假媒水火冯藉木石而后倾注而出焉此人巧聪明不知于何禀度也",
        "人间负重致远恃有舟车乃车得一铢而辖转舟得一石而罅完非此物之为功也不可行矣至{艹俎}蔬之登釜也莫或膏之犹啼儿失乳焉斯其功用一端而已哉",
        "油品",
        "凡油供馔食用者胡麻一名脂麻莱菔子黄豆菘菜子一名白菜为上苏麻形似紫苏粒大于胡麻芸苔子江南名菜子次之茶子其树高丈余子如金罂子去壳取仁次之苋菜子次之大麻仁粒如胡荽子剥取其皮为纟聿索用者为下",
        "燃灯则桕仁内水油为上芸苔次之亚麻子陕西所种俗名壁虱脂麻气恶不堪食次之棉花子次之胡麻次之燃灯最易竭桐油与桕混油为下桐油毒气熏人桕油连皮膜则冻结不清造烛则桕皮油为上蓖麻子次之桕混油每斤入白蜡结冻次之白蜡结冻诸清油又次之樟树子油又次之其光不减但有避香气者冬青子油又次之韶郡专用嫌其油少故列次北土广用牛油则为下矣",
        "凡胡麻与蓖麻子樟树子每石得油四十斤莱菔子每石得油二十七斤甘美异常益人五脏芸苔子每石得油三十斤其耨勤而地沃榨法精到者仍得四十斤陈历一年则空内而无油茶子每石得油一十五斤油味似猪脂甚美其枯则止可种火及毒鱼用桐子仁每石得油三十三斤桕子分打时皮油得二十斤水油得十五斤混打时共得三十三斤此须绝净者冬青子每石得油十二斤黄豆每石得油九斤吴下取油食后以其饼充豕粮菘菜子每石得油三十斤油出清如绿水棉花子每百斤得油七斤初出甚黑浊澄半月清甚苋菜子每石得油三十斤味甚甘美嫌性冷滑亚麻大麻仁每石得油二十余斤此其大端其他未穷究试验与夫一方已试而他方未知者尚有待云",
        "法具",
        "凡取油榨法而外有两镬煮取法以治蓖麻与苏麻北京有磨法朝鲜有舂法以治胡麻其余则皆从榨出也凡榨木巨者围必合抱而中空之其木樟为上檀与杞次之杞木为者防地湿则速朽此三木者脉理循环结长非有纵直文故竭力挥椎实尖其中而两头无璺拆之患他木有纵文者不可为也中土江北少合抱木者则取四根合并为之铁箍裹定横拴串合而空其中以受诸质则散木有完木之用也",
        "凡开榨空中其量随木大小大者受一石有余小者受五斗不足凡开榨辟中凿划平槽一条以宛凿入中削圆上下下沿凿一小孔犀刂一小槽使油出之时流入承藉器中其平槽约长三四尺阔三四寸视其身而为之无定式也实槽尖与枋唯檀木柞子木两者宜为之他木无望焉其尖过斤斧而不过刨盖欲其涩不欲其滑惧报转也撞木与受撞之尖皆以铁圈裹首惧披散也",
        "榨具已整理则取诸麻菜子入釜文火慢炒凡桕桐之类属树木生者皆不炒而碾蒸透出香气然后碾碎受蒸凡炒诸麻菜子宜铸平底锅深止六寸者投子仁于内翻拌最勤若釜底太深翻拌疏慢则火候交伤减丧油质炒锅亦斜安灶上与蒸锅大异凡碾埋槽土内木为者以铁片掩之其上以木竿衔铁陀两人对举而椎之资本广者则砌石为牛碾一牛之力可敌十人亦有不受碾而受磨者则棉子之类是也既碾而筛择粗者再碾细者则入釜甑受蒸蒸气腾足取出以稻秸与麦秸包裹如饼形其饼外圈箍或用铁打成或破篾绞刺而成与榨中则寸相稳合",
        "凡油原因气取有生于无出甑之时包裹怠缓则水火郁蒸之气游走为此损油能者疾倾疾裹而疾箍之得油之多诀由于此榨工有自少至老而不知者包裹既定装入榨中随其量满挥撞挤轧而流泉出焉矣包内油出滓存名曰枯饼凡胡麻莱菔芸苔诸饼皆重新碾碎筛去秸芒再蒸再裹而再榨之初次得油二分二次得油一分若桕桐诸物则一榨已尽流出不必再也",
        "若水煮法则并用两釜将蓖麻苏麻子碾碎入一釜中注水滚煎其上浮沫即油以杓掠取倾于干釜内其下慢火熬干水气油即成矣然得油之数毕竟减杀北磨麻油法以粗麻布袋捩绞其法再详",
        "皮油",
        "凡皮油造浊法起广信郡其法取洁净桕子囫囵入釜甑蒸蒸后倾入臼内受舂其臼深约尺五寸碓以石为身不用铁嘴石以深山结而腻者轻重斫成限四十斤上嵌衡木之上而舂之其皮膜上油尽脱骨而纷落挖起筛于盘内再蒸包裹入榨皆同前法皮油已落尽其骨为黑子用冷腻小石磨不惧火者此磨亦从信郡深山觅取以红火矢围壅锻热将黑子逐把灌入疾磨磨破之时风扇去其黑壳则其内完全白仁与梧桐子无异将此碾蒸包裹入榨与前法同榨出水油清亮无比贮小盏之中独根心草燃至天明盖诸清油所不及者入食馔即不伤人恐有忌者宁不用耳",
        "其皮油造烛截苦竹筒两破水中煮涨不然则粘带小篾箍勒定用鹰嘴铁杓挽油灌入即成一枝插心于内顷刻冻结捋箍开筒而取之或削棍为模裁纸一方卷于其上而成纸筒灌入亦成一烛此烛任置风尘中再经寒暑不敝坏也"
      ]
    },
    {
      "title": "杀青",
      "content": [
        "宋子曰物象精华乾坤微妙古传今而华达夷使后起含生目授而心识之承载者以何物哉君与民通师将弟命冯藉占占口语其与几何持寸符握半卷终事诠旨风行而冰释焉覆载之间之藉有楮先生也圣顽咸嘉赖之矣身为竹骨为与木皮杀其青而白乃见万卷百家基从此起其精在此而其粗效于障风护物之间事已开于上古而使汉晋时人擅名记者何其陋哉",
        "纸料",
        "凡纸质用楮树一名谷树皮与桑穰芙蓉膜等诸物者为皮纸用竹麻者为竹纸精者极其洁白供书文印文柬启用粗者为火纸包裹纸所谓“杀青”以斩竹得名“汗青”以煮沥得名“筒”即已成纸名乃煮竹成筒后人遂疑削竹片以纪事而又误疑韦编为皮条穿竹札也秦火未经时书籍繁甚削竹能藏几何如西番用贝树造成纸叶中华又疑以贝叶书经典不知树叶离根即焦与削竹同一可哂也",
        "造竹纸",
        "凡造竹纸事出南方而闽省独专其盛当笋生之后看视山窝深浅其竹以将生枝叶者为上料节界芒种则登山斫伐截断五七尺长就于本山开塘一口注水其中漂浸恐塘水有涸时则用竹枧通引不断瀑流注入浸至百日之外加功槌洗洗去粗壳与青皮是名杀青其中竹穰形同苎麻样用上好石灰化汁涂浆入皇桶下煮火以八日八夜为率",
        "凡煮竹下锅用径四尺者锅上泥与石灰捏弦高阔如广中煮盐牢盆样中可载水十余石上盖皇桶其围丈五尺其径四尺余盖定受煮八日已足歇火一日揭皇取出竹麻入清水漂塘之内洗净其塘底面四维皆用木板合缝砌完以防泥污造粗纸者不须为此洗净用柴灰浆过再入釜中其上按平平铺稻草灰寸许桶内水滚沸即取出别桶之中仍以灰汁淋下倘水冷烧滚再淋如是十余日自然臭烂取出入臼受舂山国皆有水碓舂至形同泥面倾入槽内",
        "凡抄纸槽上合方斗尺寸阔狭槽视帘帘视纸竹麻已成槽内清水浸浮其面三寸许入纸药水汁于其中形同桃竹叶方语无定名则水干自成洁白凡抄纸帘用刮磨绝细竹丝编成展卷张开时下有纵横架框两手持帘入水荡起竹麻入于帘内厚薄由人手法轻荡则薄重荡则厚竹料浮帘之顷水从四际淋下槽内然后覆帘落纸于板上叠积千万张数满则上以板压俏绳入棍如榨酒法使水气净尽流干然后以轻细铜镊逐张揭起焙干凡焙纸先以土砖砌成夹巷地面下以砖盖地面数块以往即空一砖火薪从头穴烧发火气从砖隙透巷外砖尽热湿纸逐张贴上焙干揭起成帙",
        "近世阔幅者名大四连一时书文贵重其废纸洗去朱墨污秽浸烂入槽再造全省从前煮浸之力依然成纸耗亦不多南方竹贱之国不以为然北方即寸条片角在地随手拾取再造名曰还魂纸竹与皮精与细皆同之也若火纸糙纸斩竹煮麻灰浆水淋皆同前法唯脱帘之后不用烘焙压水去湿日晒成干而已",
        "盛唐时鬼神事繁以纸钱代焚帛北方用切条名曰板钱故造此者名曰火纸荆楚近俗有一焚侈至千斤者此纸十七供冥烧十三供日用其最粗而厚者曰包裹纸则竹麻和宿田晚稻稿所为也若铅山诸邑所造柬纸则全用细竹料厚质荡成以射重价最上者曰官柬富贵之家通刺用之其纸敦厚而无筋膜染红为吉柬则先以白矾水染过后上红花汁云",
        "造皮纸",
        "凡楮树取皮于春末夏初剥取树已老者就根伐去以土盖之来年再长新条其皮更美凡皮纸楮皮六十斤仍入绝嫩竹麻四十斤同塘漂浸同用石灰浆涂入釜煮糜近法省啬者皮竹十七而外或入宿田稻稿十三用药得方仍成洁白凡皮料坚固纸其纵文扯断绵丝故曰绵纸衡断且费力其最上一等供用大内糊窗格者曰棂纱纸此纸自广信郡造长过七尺阔过四尺五色颜料先滴色汁槽内和成不由后染其次曰连四纸连四中最白者曰红上纸皮名而竹与稻稿参和而成料者曰揭贴呈文纸",
        "芙蓉等皮造者统曰小皮纸在江西则曰中夹纸河南所造未详何草木为质北供帝京产亦甚广又桑皮造者曰桑穰纸极其敦厚东浙所产三吴收蚕种者必用之凡糊雨伞与油扇皆用小皮纸",
        "凡造皮纸长阔者其盛水槽甚宽巨帘非一人手力所胜两人对举荡成若棂纱则数人方胜其任凡皮纸供用画幅先用巩水荡过则毛茨不起纸以逼帘者为正面盖料即成泥浮其上者粗意犹存也朝鲜白︴纸不知用何质料倭国有造纸不用帘抄者煮料成糜时以巨阔青石覆于炕面其下火使石发烧然后用糊刷蘸糜薄刷石面居然顷刻成纸一张一揭而起其朝鲜用此法与否不可得知中国有用此法者亦不可得知也永嘉蠲糨纸亦桑穰造四川薛涛笺亦芙蓉皮为料煮糜入芙蓉花末汁或当时薛涛所指遂留名至今其美在色不在质料也"
      ]
    },
    {
      "title": "五金",
      "content": [
        "宋子曰人有十等自王公至于舆台缺一焉而人纪不立矣大地生五金以利用天下与后世其义亦犹是也贵者千里一生促亦五六百里而生贱者舟车稍艰之国其土必广生焉黄金美者其值去黑铁一万六千倍然使釜ň斤斧不呈效于日用之间即得黄金直高而无民耳懋迁有无货居周官泉府万物司命系焉其分别美恶而指点重轻孰开其先而使相须于不朽焉",
        "黄金",
        "凡黄金为五金之长熔化成形之后住世永无变更白银入洪炉虽无折耗但火候足时鼓鞲而金花闪烁一现即没再鼓则沉而不现惟黄金则竭力鼓鞲一扇一花愈烈愈现其质所以贵也凡中国产金之区大约百余处难以枚举山石中所出大者名马蹄金中者名橄榄金带胯金小者名瓜子金水沙中所出大者名狗头金小者名<麦夫>麦金糠金平地掘井得者名面沙金大者名豆粒金皆待先淘洗后冶炼而成颗块",
        "金多出西南取者穴山至十余丈见伴金石即可见金其石褐色一头如火烧黑状水金多者出云南金沙江古名丽水此水源出吐蕃绕流丽江府至于北胜州回环五百余里出金者有数截又川北潼川等州邑与湖广沅陵溆浦等皆于江沙水中淘沃取金千百中间有获狗头金一块者名曰金母其余皆<麦夫>麦形入冶煎炼初出色浅黄再炼而后转赤也儋崖有金田金杂沙土之中不必深求而得取太频则不复产经年淘炼若有则限然岭南夷獠洞穴中金初出如黑铁落深挖数丈得之黑焦石下初得时咬之柔软夫匠有吞窃腹中者亦不伤人河南蔡矾等州邑江西乐平新建等邑皆平地掘深井取细沙淘炼成但酬答人功所获亦无几耳大抵赤县之内隔千里而一生岭南录云居民有从鹅鸭屎中淘出片屑者或日得一两或空无所获此恐妄记也",
        "凡金质至重每铜方寸重一两者银照依其则寸增重三钱银方寸重一两者金照依其则寸增重二钱凡金性又柔可屈折如枝柳其高下色分七青八黄九紫十赤登试金石上此石广信郡河中甚多大者如斗小者如拳入鹅汤中一煮光黑如漆立见分明凡足色金参和伪售者唯银可入余物无望焉欲去银存金则将其金打成薄片剪碎每块以土泥裹涂入坩锅中硼砂熔化其银即吸入土内让金流出以成足色然后入铅少许另入坩锅内勾出土内银亦毫厘具在也",
        "凡色至于金为人间华美贵重故人工成箔而后施之凡金箔每金七分造方寸金一千片粘铺物面可盖纵横三尺凡造金箔既成薄片后包入乌金纸内竭力挥椎打成打金椎短柄约重八斤凡乌金纸由苏杭造成其纸用东海巨竹膜为质用豆油点灯闭塞周围止留针孔通气熏染烟光而成止纸每纸一张打金箔五十度然后弃去为药铺包朱用尚末破损盖人巧造成异物也凡纸内打成箔后先用硝熟猫皮绷急为小方板又铺线香灰撒墁皮上取出乌金纸内箔覆于其上钝刀界画成方寸口中屏息手执轻杖唾湿而挑起夹于小纸之中以之华物先以熟漆布地然后粘贴贴字者多用楮树浆秦中造皮金者硝扩羊皮使最薄贴金其上以便剪裁服饰用皆煌煌至色存焉凡金箔粘物他日敝弃之时刮削火化其金仍藏灰内滴清油数点伴落聚底淘洗入炉毫厘无恙",
        "凡假借金色者杭扇以银箔为质红花子油刷盖向火熏成广南货物以蝉蜕壳调水描画向火一微炙而就非真金色也其金成器物呈分浅淡者以黄矾涂染炭火炸炙即成赤宝色然风尘逐渐淡去见火又即还原耳黄矾详燔石卷",
        "银",
        "凡银中国所出浙江福建旧有坑场国初或采或闭江西饶信瑞三郡有坑从末开湖广则出辰州贵州则出铜仁河南则宜阳赵保山永宁秋树坡卢氏高嘴儿嵩县马槽山与四川会川密勒山甘肃大黄山等皆称美矿其他难以枚举然生气有限每逢开采数不足则括派以赔偿法不严则窃争而酿乱故禁戒不得不苛燕齐诸道则地气寒而石骨薄不产金银然合八省所生不敌云南之半故开矿煎银唯滇中可永行也",
        "凡云南银矿楚雄永昌大理为最盛曲靖姚安次之镇沅又次之凡石山硐中有铆砂其上现磊然小石微带褐色者分丫成径路采者穴土十丈或二十丈工程不可日月计寻见土内银苗然后得礁砂所在凡樵砂藏深土如枝分派别各人随苗分径横挖而寻之上耆横板架顶以防崩压采工篝灯逐径施得矿方止凡土内银苗或有黄色碎石或土隙石缝有乱丝形状此即去矿不远矣凡成银者曰礁至碎者如砂其面分丫若枝形者曰铆其外包环石块曰矿矿石大者如斗小者如拳为弃置无用物其礁砂形如煤炭底衬石而不甚黑其高下有数等商民凿穴得砂先呈官府验辨然后定税出土以斗量付与冶工高者六七两一斗中者三四两最下一二两其礁砂放光甚者精华泄露得银偏少",
        "凡礁砂入炉先行拣净淘洗其炉土筑巨墩高五尺许底铺瓷屑炭灰每炉受礁砂二石用栗木炭二百斤周遭丛架靠炉砌砖墙一朵高阔皆丈余风箱安置墙背合两三人力带拽透管通风用墙以抵炎热鼓鞲之人方克安身炭尽之时以长铁叉添入风火力到礁砂溶化成团此时银隐铅中尚未出脱计礁砂二石溶出团约重百斤",
        "冷定限出另入分金炉一名虾蟆炉内用松木炭匝围透一门以辨火色其炉或施风箱或使交Ψ火热功到铅沉下为底子其底已成陀僧样别入炉炼又成扁担铅频以柳枝从门隙入内燃照铅气净尽则世宝凝然成象矣此初出银亦名生银倾定无丝纹即再经一火当中止现一点圆星滇人名曰“茶经”逮后入铜少许重以铅力熔化然后入槽成丝丝必倾槽而现以四围匡住宝气不横溢走散其楚雄所出又异彼硐砂铅气甚少向诸郡购铅佐炼每礁百斤先坐铅二百斤于炉内然后煽炼成团其再入虾蟆炉沉铅结银则同法也此世宝所生更无别出方书本草无端妄想妄注可厌之甚",
        "大抵坤元精气出金之所三百里无银出银之所三百里无金造物之情亦大可见其贱役扫刷泥尘入水漂淘而煎者名曰淘厘锱一日功劳轻者所获三分重者倍之其银俱日用剪斧口中委余或鞋底粘带布于衢市或院宇扫屑弃于河沿其中必有焉非浅浮土面能生此物也",
        "凡银为世用惟红铜与铅两物可杂入成伪然当其合琐碎而成钣锭去疵伪而造精纯高炉火中坩锅足炼撒硝少许而铜铅尽滞锅底名曰银锈其灰池中敲落者名曰炉底将锈与底同入分金炉内填火土甑之中其铅先化就低溢流而铜与粘带余银用铁条逼就分拨井然不紊人工天工亦见一斑云炉式并具于后",
        "附朱砂银",
        "凡虚伪方士以炉火惑人者唯朱砂银愚人易惑其法以投铅朱砂与白银等分入罐封固温养三七日后砂盗银气煎成至宝拣出其银形有神丧块然枯物入铅煎时逐火轻折再经数火毫忽无存折去砂价炭资愚者贪惑犹不解并志于此",
        "铜",
        "凡铜供世用出山与出炉只有赤铜以炉甘石或倭铅参和转色为黄铜以砒霜等药制炼为白铜矾硝等药制炼为青铜广锡参和为响铜倭铅和写为铸铜初质则一味红铜而已",
        "凡铜坑所在有之山海经言出铜之山四百六十七或有所考据也今中国供用者西自四川贵州为最盛东南间自海舶来湖广武昌江西广信皆饶铜穴其衡瑞等郡出最下品曰蒙山铜者或入冶铸混入不堪升炼成坚质也",
        "凡出铜山夹土带石穴凿数丈得之仍有矿包其外矿状如姜石而有铜星亦名铜璞煎炼仍有铜流出不似银矿之为弃物凡铜砂在矿内形状不一或大或小或光或暗或如石或如姜铁淘洗去土滓然后入炉煎炼其熏蒸傍溢者为自然铜亦曰石髓铅",
        "凡铜质有数种有全体皆铜不夹铅银者洪炉单炼而成有与铅同体者其煎炼炉法傍通高低二孔铅质先化从上孔流出铜质后化从下孔流出东夷铜又有托体银矿内者入炉炼时银结于面铜沉于下商舶漂入中国名曰日本铜其形为方长板条漳郡人得之有以炉再炼取出零银然后泻成薄饼如川铜一样货卖者",
        "凡红铜升黄色为锤锻用者用自风煤炭此煤碎如粉泥糊作饼不用鼓风通红则自昼达夜江西则产袁郡及新喻邑百斤灼于炉内以泥瓦罐载铜十斤继入炉甘石六斤坐于炉内自然熔化后人因炉甘石烟洪飞损改用倭铅每红铜六斤入倭铅四斤先后入罐熔化冷定取出即成黄铜唯人打造",
        "凡用铜造响器用出山广锡无铅气者入内钲今名锣镯今名铜鼓之类皆红铜八斤入广锡二斤铙钹铜与锡更加精炼凡铸器低者红铜倭铅均平分两甚至铅六铜四高者名三火黄铜四火熟铜则铜七而铅三也",
        "凡造低伪银者唯本色红铜可入一受倭铅砒矾等气则永不和合然铜入银内使白质顿成红色洪炉再鼓则清浊浮沉立分至于净尽云",
        "附倭铅",
        "凡倭铅古书本无之乃近世所立名色其质用炉甘石熬炼而成繁产山西太行山一带而荆衡为次之每炉甘石十斤装载入一泥罐内封裹泥固以渐砑干勿使见火拆裂然后逐层用煤炭饼垫盛其底铺薪发火煅红罐中炉甘石熔化成团冷定毁罐取出每十耗去其二即倭铅也此物无铜收伏入火即成烟飞去以其似铅而性猛故名之曰倭云",
        "铁",
        "凡铁场所在有之其铁浅浮土面不生深穴繁生平阳冈埠不生峻岭高山质有土锭碎砂数种凡土锭铁土面浮出黑块形似枰锤遥望宛然如铁之则碎土若起冶煎炼浮者拾之又乘雨湿之后牛耕起土拾其数寸土内者耕垦之后其块逐日生长愈用不穷西北甘肃东南泉郡皆锭铁之薮也燕京遵化与山西平阳则皆砂铁之薮也凡砂铁一抛土膜即现其形取来淘洗入炉煎炼熔化之后与锭铁无二也",
        "凡铁分生熟出炉未炒则生既炒则熟生熟相和炼成则钢凡铁炉用盐做造和泥砌成其炉多傍山穴为之或用巨木匡围朔造盐泥穷月之力不容造次盐泥有罅尽弃全功凡铁一炉载土二千余斤或用硬木柴或用煤炭或用木炭南北各从利便扇炉风箱必用四人六人带拽土化成铁之后从炉腰孔流出炉孔先用泥塞每旦昼六时一时出铁一陀既出即叉泥塞鼓风再熔",
        "凡造生铁为冶铸用者就此流成长条圆块范内取用若造熟铁则生铁流出时相连数尺内低下数寸筑一方塘短墙抵之其铁流入塘内数人执持柳木棍排立墙上先以污潮泥晒干舂筛细罗如面一人疾手撒扌艳众人柳棍疾搅即时炒成熟铁其柳棍每炒一次烧折二三寸再用则又更之炒过稍冷之时或有就塘内斩划成方块者或有提出挥椎打圆后货者若济阳诸冶不知出此也",
        "凡钢铁炼法用熟铁打成薄片如指头阔长寸半许以铁片束尖紧生铁安置其上广南生铁名堕子生钢者妙甚又用破草履盖其上粘带泥土者故不速化泥涂其底下洪炉鼓鞲火力到时生钢先化渗淋熟铁之中两情投合取出加锤再炼再锤不一而足俗名团钢亦曰灌钢者是也",
        "凡倭夷刀剑有百炼精纯置日光檐下则满室辉曜者不用生熟相和炼又名此钢为下乘云夷人又有以地溲淬刀剑者地溲乃石脑油之类不产中国云钢可切玉亦末之见也凡铁内有硬处不可打者名铁核以香油涂之即散凡产铁之阴其阳出慈石第有数处不尽然也",
        "锡",
        "凡锡中国偏出西南郡邑东北寡生古书名锡为“贺”者以临贺郡产锡最盛而得名也今衣被天下者独广西南丹河池二州居其十八衡永则次之大理楚雄即产锡甚盛道远难致也",
        "凡锡有山锡水锡两种山锡中又有锡瓜锡砂两种锡瓜块大如小瓠锡砂如豆粒皆穴土不甚深而得之间或土中生脉充刃致山土自颓恣人拾取者水锡衡永出溪中广西则出南丹州河内其质黑色粉碎如重罗面南丹河出者居民旬前从南淘至北旬后又从北淘至南愈经淘取其砂日长百年不竭但一日功劳淘取煎炼不过一斤会计炉炭资本所获不多也南丹山锡出山之阴其方无水淘洗则接连百竹为枧从山阳枧水淘洗土滓然后入炉",
        "凡炼煎亦用洪炉入砂数百斤丛架木炭亦数百斤鼓鞲熔化火力已到砂不即熔用铅少许勾引方始沛然流注或有用人家炒锡剩灰勾引者其炉底炭末瓷灰铺作平地傍安铁管小槽道熔时流出炉外低池其质初出洁白然过刚承锤即拆裂入铅制柔方充造器用售者杂铅太多欲取净则熔化入醋淬八九度铅尽化灰而去出锡唯此道方书云马齿苋取草锡者妄言也谓砒为锡苗者亦妄言也",
        "铅",
        "凡产铅山穴繁于铜锡其质有三种一出银矿中包孕白银初炼和银成团再炼脱银沉底曰银矿铅此铅云南为盛一出铜矿中入烘炉炼化铅先出铜后随曰铜山铅此铅贵州为盛一出单生铅穴取者穴山石挟油灯寻脉曲折如采银矿取出淘洗煎炼名曰草节铅此铅蜀中嘉利等州为盛其余雅州出钓脚铅形如皂荚子又如蝌斗子生山涧沙中广信郡上饶饶郡乐平出杂铜铅剑州出阴平铅难以枚举",
        "凡银矿中铅炼铅成底炼底复成铅草节铅单入烘炉煎炼炉傍通管注入长条土槽内俗名扁担铅亦曰出山铅所以别于凡银炉内频经煎炼者凡铅物值虽贱变化殊奇白粉黄丹皆其显像操银底于精纯勾锡成其柔软皆铅力也",
        "附胡粉",
        "凡造胡粉每铅百斤熔化削成薄片卷作筒安木甑内甑下甑中各安醋一瓶外以盐泥固济纸糊甑缝安火四两养之七日期足启开铅片皆生霜粉扫入水缸内未生霜者入甑依旧再养七日再扫以质尽为度其不尽者留作黄丹料",
        "每扫下霜一斤入豆粉二两蛤粉四两缸内搅匀澄去清水用细灰按成沟纸隔数层置粉于上将干截成瓦定形或如磊鬼待干收货此物古因辰韶诸郡专造故曰韶粉俗误朝粉今则各省直饶为之矣其质入丹青则白不减揸妇人颊能使本色转青胡粉投入炭炉中仍还熔化为铅所谓色尽归皂者",
        "附黄丹",
        "凡炒铅丹用铅一斤土硫黄十两硝石一两熔铅成汁下醋点之滚沸时下硫一块少顷入硝少许沸定再点醋依前渐下硝黄待为末则成丹矣其胡粉残剩者用硝石矾石炒成丹不复用醋也欲丹还铅用葱白汁拌黄丹馒炒金汁出时倾出即还铅矣"
      ]
    },
    {
      "title": "佳兵",
      "content": [
        "宋子曰兵非圣人之得已也虞舜在位五十载而有苗犹弗率明王圣帝谁能去兵哉弧矢之利以威天下其来尚矣为老氏者有葛天之思焉其词有曰“佳兵者不详之器”盖言慎也",
        "火药机械之窍其先凿自西番与南裔而后乃及于中国变幻百出日盛月新中国至今日则即戎者以为第一义岂其然哉虽然生人纵有巧思乌能至此极也",
        "弧矢",
        "凡造弓以竹与牛角为正中干质东北夷无竹以柔木为之桑枝木为两梢弛则竹为内体角护其外张则角向内而竹居外竹一条而角两接桑肖则其末刻锲以受弦区其本则贯插接笋于竹丫而光削一面以贴角",
        "凡造弓先削竹一片竹宜秋冬伐春夏则朽蛀中腰微亚小两头差大约长二尺许一面粘胶靠角一面铺置牛筋与胶而固之牛角当中牙接北边无修长牛角则以羊角四接而束之广弓则黄牛明角亦用不独水牛也固以筋胶胶外固以桦皮名曰暖靶凡桦木关外产辽阳北土繁生遵化西陲繁生临洮郡闽广浙亦皆有之其皮护物手握如软绵故弓靶所必用即刀柄与枪干亦需用之其最薄者则为刀剑鞘室也",
        "凡牛脊梁每只生筋一方条约重三十两杀取晒干复浸水中析破如苎麻丝北边无蚕丝弓弦处皆纠合此物为之中华则以之铺护弓干与为棉花弹弓弦也凡胶乃鱼脬杂肠所为煎治多属宁国郡其东海石首鱼浙中以造白鲞者取其脬为胶坚固过于金铁北边取海鱼脬煎成坚固与中华无异种性则别也天生数物缺一而良弓不成非偶然也",
        "凡造弓初成坯后安置室中梁阁上地面勿离火意促者旬日多者两月透干其津液然后取下磨光重加筋胶与漆则其弓良甚货弓之家不能俟日足者则他日解释之患因之",
        "凡弓弦取食柘叶蚕茧其丝更坚韧每条用丝线二十余根作骨然后用线横缠紧约缠丝分三停隔七寸许则空一二分不缠故弦不张弓时可折叠三曲而收之往者北边弓弦尽以牛筋为质故夏月雨雾妨其解脱不相侵犯今则丝弦亦广有之涂弦或用黄蜡或不用亦无害也凡弓两肖系区处或以最厚牛皮或削柔木如小棋子钉粘角端名曰垫弦义同琴轸放弦归返时雄力向内得此而抗止不然则受损也",
        "凡造弓视人力强弱为轻重上力挽一百二十斤过此则为虎力亦不数出中力减十之二三下力及其半彀满之时皆能中的但战阵之上洞胸彻札功必归于挽强者而下力倘能穿杨贯虱则以巧胜也凡试弓力以足踏弦就地称钩搭挂弓腰弦满之时推移称锤所压则知多少其初造料分两则上力挽强者角与竹片削就时约重七两筋与胶漆与缠约丝绳约重八钱此其大略中力减十之一二下力减十之二三也",
        "凡成弓藏时最嫌霉湿霉气先南后北岭南谷雨时江南小满江北六月燕齐七月然淮扬霉气独盛将士家或置烘厨烘箱日以炭火置其下春秋雾雨皆然不但霉气小卒无烘厨则安顿灶突之上稍怠不勤立受朽解之患也近岁命南方诸省造弓解北纷纷驳回不知离火即坏之故亦无人陈说本章者",
        "凡箭中国南方竹质北方萑柳质北边桦质随方不一竿长二尺簇长一寸其大端也凡竹箭削竹四条或三条以胶粘合过刀光削而圆成之漆丝缠约两头名曰\"三不齐\"箭杆浙与广南有生成箭竹不破合者柳与桦杆则取彼圆直枝条而为之微费刮削而成也凡竹箭其体自直不用矫揉木杆则燥时必曲削造成时以数寸之木刻槽一条名曰箭端将木杆逐寸戛拖而过其身乃直即首尾轻重亦由过端而均停也",
        "凡箭其本刻衔口以驾弦其末受镞凡镞冶铁为之禹贡石乃方物不适用北边制如桃叶枪尖广南黎人矢镞如平面铁铲中国则三棱锥象也响箭则以寸木空中锥眼为窍矢过招风而飞鸣即庄子所谓嚆矢也凡箭行端斜与疾慢窍妙皆系本端翎羽之上箭本近衔处剪翎直贴三条其长三寸鼎足安顿粘以胶名曰箭羽此胶亦忌霉湿故将卒勤者箭亦时以火烘",
        "羽以雕膀为上雕似鹰而大尾长翅短角鹰次之鸱鹞又次之南方造箭者雕无望焉即鹰鹞亦难得之货急用塞数即以雁翎甚至鹅翎亦为之矣凡雕翎箭行疾过鹰鹞翎十余步而端正能抗风吹北边羽箭多出此料鹰鹞翎作法精工亦恍惚焉若鹅雁之质则释放之时手不应心而遇风斜窜者多矣面箭不及北由此分也",
        "弩",
        "凡弩为守营兵器不利行阵直者名身衡者名翼弩牙发弦者名机斫木为身约长二尺许身之首横拴度翼其空缺度翼处去面刻定一分稍厚则弦发不应节去背则不论分数面上微刻直槽一条以盛箭其翼以柔木一条为者名扁担弩力最雄或一木之下加以竹片叠承其竹一片短一片名三撑弩或五撑七撑而止身下截刻锲衔弦其衔傍活钉牙机上剔发弦上弦之时唯力是视一人以脚踏强弩而弦者汉书名曰“蹶张材官”弦送矢行其疾无与比数",
        "凡弩弦以苎麻为质缠绕以鹅翎涂以黄蜡其弦上翼则谨放下仍松故鹅翎可扌及首尾于绳内弩箭羽以箬叶为之析破箭本衔于其中而缠约之其射猛兽药箭则用草乌一味熬成浓胶蘸染矢刃见血一缕则命即绝人畜同之凡弓箭强者行二百余步弩箭最强者五十步而止即过咫尺不能穿鲁缟矣然其行疾则十倍于弓而入物之深亦倍之",
        "国朝军器造神臂弩克敌弩皆并发二矢三矢者又有诸葛弩其上刻直槽相承函十矢其翼取最柔木为之另安机木随手扳弦而上发去一矢槽中又落一矢则又扳木上弦而发机巧虽工然其力绵甚所及二十余步而已此民家妨窃具非军国器其山人射猛兽者名曰窝弩安顿交迹之衢机傍引线俟兽过带发而射之一发所获一兽而已",
        "干",
        "凡干戈名最古干与戈相连得名者后世战卒短兵驰骑者更用之盖右手执短刀左手执干以蔽敌矢古者车战之上则有专司执干并抵同人之受矢者若双手执长戈与持戟槊则无所用之也凡干长不过三尺杞柳织成尺径圈置于项下上出五寸亦锐其端下则轻竿可执若盾名中干则步卒所持以蔽矢并拒槊者俗所谓傍牌是也",
        "火药料",
        "火药火器今时妄想进身博官者人人张目而道著书以献未必尽由试验然亦粗载数叶附于卷内凡火药以硝石硫黄为主草木灰为铺硝性至阴硫性至阳阴阳两神物相遇于无隙可容之中其出也人物膺之魂散惊而魄齑粉凡硝性主直直击者硝九而硫一硫性主横爆击者硝七而硫三其佐使之灰则青杨枯杉桦根箬叶蜀葵毛竹根茄秸之类烧使存性而其中箬叶为最燥也",
        "凡火攻有毒火神火法火烂火喷火毒火以白砒砂为君金汁银锈人粪和制神火以朱砂雄黄雌黄为君烂火以硼砂磁末牙皂秦椒配合飞火以朱砂石黄轻粉草乌巴豆配合劫营火则用桐油松香此其大略其狼粪烟昼黑夜红迎风直上与江豚灰能逆风而炽皆须试见而后详之",
        "硝石",
        "凡硝华夷皆生中国则专产西北若东南贩者不给官引则以为私货而罪之硝质与盐同母大地之下潮气蒸成现于地面近水而土薄者成盐近山而土厚者成硝以其入水即硝熔故名曰“硝”长淮以北节过中秋即居室之中隔日扫地可取少许以供煎炼",
        "凡硝三所最多出蜀中者曰川硝生山西者俗呼盐硝生山东者俗呼土硝凡硝刮扫取时墙中亦或迸出入缸内水浸一宿秽杂之物浮于面上掠取去时然后入釜注水煎炼硝化水干倾于器内经过一宿即结成硝其上浮者曰芒硝芒长者曰马牙硝皆从方产本质幻出其下猥杂者曰朴硝欲去杂还纯再入水煎炼入莱菔数枚同煮熟倾入盆中经宿结成白雪则呼盆硝",
        "凡制火药牙硝盆硝功用皆同凡取硝制药少者用新瓦焙多者用土釜焙潮气一干即成研末凡研硝不以铁碾入石臼相激火生则祸不可测凡硝配定何药分两入黄同研木灰则从后增入凡硝既焙之后经久潮性复生使用巨泡多从临期装载也",
        "硫黄详见燔石卷",
        "凡硫黄配硝而后火药成声北狄无黄之国空繁硝产故中国有严禁凡燃炮拈硝与木灰为引线黄不入内入黄即不透关凡碾黄难碎每黄一两和硝一钱同碾则立成微尘细末也",
        "火器",
        "西洋炮熟铜铸就圆形若铜鼓引放时半里之内人马受惊死平地引炮有关捩前行遇坎方止点引之人反走坠入深坑内炮声在高头放者方不丧命红夷炮铸铁为之身长丈许用以守城中藏铁弹并火药数斗飞激二里膺其锋者为齑粉凡炮引内灼时先往后坐千钧力其位须墙抵住墙崩者其常",
        "大将军　二将军即红夷之次在中国为巨物　佛郎机水战舟头用",
        "三眼铳　百子连珠炮",
        "地雷埋伏土中竹管通引冲土起击其身从其炸裂所谓横击用黄多者引线用矾油炮口覆以盆",
        "混江龙漆固皮囊炮沉于水底岸上带索引机囊中悬吊火石火镰索机一动其中自发敌舟行过遇之则败然此终痴物也",
        "鸟铳凡鸟铳长约三尺铁管载药嵌盛木棍之中以便手握凡锤鸟铳先以铁梃一条大如箸为冷骨裹红铁锤成先为三接接口炽红竭力撞合合后以四棱钢锥如箸大者透转其中使极光净则发药无阻滞其本近身处管亦大于末所以容受火药每铳约载配消一钱二分铅铁弹子二钱发药不用信引岭南制度有用引者孔口通内处露消分厘捶熟苎麻点火左手握铳对敌右手发铁机逼苎火于消上则一发而去鸟雀遇于三十步内者羽肉皆粉碎五十步外方有完形若百步则铳力竭矣鸟枪行远过二百步制方仿佛鸟铳而身长药多亦皆倍此也",
        "万人敌凡外郡小邑乘城却敌有炮力不具者即有空悬火炮而痴重难使者则万人敌近制随宜可用不必拘执一方也盖消黄火力所射千军万马立时糜烂其法用宿干空中泥团上留小眼筑实消黄火药参入毒火神火由人变通增损贯药安信而后外以木架匡围或有即用木桶而塑泥实其内郭者其义亦同若泥团必用木匡所以妨掷投先碎也敌攻城时燃灼引信抛掷城下火力出腾八面旋转旋向内时则城墙抵信不伤我兵旋向外时则敌人马皆无幸此为守城第一器而能通火药之性火器之方者聪明由人作者不上十年守土者留心可也"
      ]
    },
    {
      "title": "丹青",
      "content": [
        "宋子曰斯文千古之不坠也注玄尚白其功孰与京哉离火红而至黑孕其中水银白而至红呈其变造化炉锤思议何所容也五章遥降朱临黑而大号彰万卷横披墨得朱而天章焕文房异宝珠玉何为至画工肖像万物或取本姿或从配合而色色咸备焉夫亦依坎附离而共呈五行变态非至神孰能与于斯哉",
        "朱",
        "凡朱砂水银银朱原同一物所以异名者由精细老嫩而分也上好朱砂出压辰锦今名麻阳与西川者中即孕Е然不以升炼盖光明箭镞镜面等砂其价重于水银三倍故择出为朱砂货鬻若以升水反降贱值唯粗次朱砂方以升炼水银而水银又升银朱也",
        "凡朱砂上品者穴土十余丈乃得之始见其苗磊然白石谓之朱砂床近床之砂有如鸡子大者其次砂不入药只为研供画用与升炼水银者其苗不必白石其深数丈即得外床或杂青黄石或间沙土土中孕满则其外沙石多自折裂此种砂贵州思印铜仁等地最繁而商州秦州出亦广也",
        "凡次砂取来其通坑色带白嫩者则不以研朱尽以升Е若砂质即嫩而烁视欲丹者则取来时入巨铁碾槽中轧碎如微尘然后入缸注清水澄浸过三日夜跌取其上浮者倾入别缸名曰二朱其下沉结者晒干即名头朱也",
        "凡升水银或用嫩白次砂或用缸中跌出浮面二朱水和槎成大盘条每三十斤入一釜内升Е其下炭质亦用三十斤凡升Е上盖一釜釜当中留一小孔釜傍盐泥紧固釜上用铁打成一曲弓溜管其管用麻绳缠通梢仍用盐泥涂固煅火之时曲溜一头插入釜中通气插处一丝固密一头以中罐注水两瓶插曲溜尾于内釜中之气在达于罐中之水而止共煅五个时辰其中砂末尽化成Е布于满釜冷定一日取出扫下此最妙玄化全部天机也本草胡乱注“凿地一孔放碗一个盛水”",
        "凡将水银再升朱用故名曰银朱其法或用磬口泥罐或用上下釜每水银一斤入石亭脂即硫黄制造者二斤同研不见星炒作青砂头装于罐内上用铁盏盖定盏上压一铁尺铁线兜底捆缚盐泥固济口缝下用三钉插地鼎足盛罐打火三炷香久频以废笔蘸水擦盏则银自成粉贴于罐上其贴口者朱更鲜华冷定揭出刮扫即用其石亭脂沉下罐底可取再用也每升水银一斤得朱十四两次朱三两五钱出数藉硫质而生",
        "凡升朱与研朱功用亦相仿若皇家贵家画彩则即同辰锦丹砂研成者不用此朱也凡朱文房胶成条块石砚则显若磨于锡砚之上则立成皂汁即漆工以鲜物彩唯入桐油调则显入漆亦晦也凡水银与朱更无他出其Е海草Е之说无端狂妄耳食者信之若水银已升朱则不可复还为Е所谓造化之巧已尽也",
        "墨",
        "凡墨烧烟凝质而为之取桐油清油猪油烟为者居十之一取松烟为者居十之九凡造贵重墨者国朝推重徽郡人或以载油之艰遣人僦居荆襄辰沅就其贱值桐油点烟而归其墨他日登于纸上日影横射有红光者则以紫草汁浸染灯心而燃炷者也",
        "凡油取烟每油一斤得上烟一两余手力捷疾者一人供事灯盏二百付若刮取怠缓则烟老火燃质料并丧也其余寻常用墨则先将松树流去胶香然后伐木凡松香有一毛未净尽其烟造墨终有滓结不解之病凡松树流去香木根凿一小孔炷灯缓炙则通身膏液就暖倾流而出也",
        "凡烧松烟伐松斩成尺寸鞠篾为圆屋如舟中雨篷式接连十余丈内外与接口皆以纸及席糊固完成隔位数节小孔出烟其下掩土砌砖先为通烟道路燃薪数日歇冷入中扫刮凡烧松烟放火通烟自头彻尾靠尾一二节者为清烟取入佳墨为料中节者为混烟取为时墨料若近头一二节只刮取为烟子货卖刷印书文家仍取研细用之其余则供漆工垩工之涂玄者",
        "凡松烟造墨入水久浸以浮沉分清悫其和胶之后以捶敲多寡分脆坚其增入珍料与漱金衔麝则松烟油烟增减听人其余墨经墨谱博物者自详此不过粗纪质料原因而已",
        "附",
        "胡粉至白色详五金卷",
        "黄丹红黄色详五金卷",
        "淀花至蓝色详彰施卷",
        "紫粉纟辰红色贵重者用胡粉银朱对和粗者用染家红花滓汁为之",
        "大青至青色详珠玉卷",
        "铜绿至绿色黄铜打成板片醋涂其上裹藏糠内微藉暖火气逐日刮取",
        "石绿详珠玉卷",
        "代赭石殷红色处处山中有之以代郡者为最佳",
        "石黄中黄色外紫色石皮内黄一名石中黄子"
      ]
    },
    {
      "title": "曲蘖",
      "content": [
        "宋子曰狱讼日繁酒流生祸其源则何辜祀天追远沉吟商倾周雅之间若作酒醴之资曲蘖也殆圣作而明述矣惟是五谷菁华变幻得水而凝感风而化供用岐黄者神其名而坚固食羞者丹其色君臣自古配合日新眉寿介而宿痼怯其功不可殚述自非炎黄作祖末流聪明乌能竟其方术哉",
        "酒母",
        "凡酿酒必资曲药成信无曲即佳米珍黍空造不成古来曲造酒蘖造醴后世厌醴味薄遂至失传则并蘖法亦亡凡曲麦米面随方土造南北不同其义则一凡麦曲大小麦皆可用造者将麦连皮井水淘净晒干时宜盛暑天磨碎即以淘麦水和作块用楮叶包扎悬风处或用稻秸罨黄经四十九日取用",
        "造面曲用白面五斤黄豆五升以蓼汁煮烂再用辣蓼末五两杏仁泥十两和踏成饼楮叶包悬与稻秸罨黄法亦同前其用糯米粉与自然蓼汁溲和成饼生黄收用者罨法与时日亦无不同也其入诸般君臣草药少者数味多者百味则各土各法亦不可殚述近代燕京则以薏苡仁为君入曲造薏酒浙中宁绍则以绿豆为君入曲造豆酒二酒颇擅天下佳雄别载酒经",
        "凡造酒母家生黄未足视候不勤盥拭不洁则疵药数丸动辄败人石米故市曲之家必信著名闻而后不负酿者凡燕齐黄酒曲药多从淮郡造成载于舟车北市南方曲酒酿出即成红色者用曲与淮郡所造相同统名大曲但淮郡市者打成砖片而南方则用饼团其曲一味蓼身为气脉而米麦为质料但必用已成曲酒糟为媒合此糟不知相承起自何代犹之烧矾之必用旧矾滓云",
        "神曲",
        "凡造神曲所以入药乃医家别于酒母者法起唐时其曲不通酿用也造者专用白面每百斤入青蒿自然汁马蓼苍耳自然汁相和作饼麻叶或楮叶包罨如造酱黄法待生黄衣即晒收之其用他药配合则听好医者增入苦无定方也",
        "丹曲",
        "凡丹曲一种法出近代其义臭腐神奇其法气精变化世间鱼肉最朽腐物而此物薄施涂抹能固其质于炎暑之中经历旬日蛆蝇不敢近色味不离初盖奇药也",
        "凡造法用灿稻米不拘早晚舂杵极其精细水浸一七日其气臭恶不可闻则取入长流河水漂净必用山河流水大江者不可用漂后恶臭犹不可解入甑蒸饭则转成香气其香芬甚凡蒸此米成饭初一蒸半生即止不及其熟出离釜中以冷水一沃气冷再蒸则令极熟矣熟后数石共积一堆拌信",
        "凡曲信必用绝佳红酒糟为料每糟一斗入马蓼自然汁三升明矾水和化每曲饭一石入信二斤乘饭热时数人捷手拌匀初热拌至冷候视曲信入饭久复微温则信至矣凡饭拌信后倾入箩内过矾水一次然后分散入篾盘登架乘风后此风力为政水火无功",
        "凡曲饭入盘每盘约载五升其屋室宜高大防瓦上暑气侵逼室面宜向南防西晒一个时中翻拌约三次候视者七日之中即坐卧盘架之下眠不敢安中宵数起其初时雪白色经一二日成至黑色黑转褐褐转赭赭转红红极复转微黄目击风中变幻名曰生黄曲则其价与入物之力皆倍于凡曲也凡黑色转褐褐转红皆过水一度红则不复入水凡造此物曲工盥手与洗净盘簟皆令极洁一毫滓秽则败乃事也"
      ]
    },
    {
      "title": "珠玉",
      "content": [
        "宋子曰玉韫山辉珠涵水媚此理诚然乎哉抑意逆之说也大凡天地生物光明者昏浊之反滋润者枯涩之仇贵在此则贱在彼矣合浦于阗行程相去二万里珠雄于此玉峙于彼无胫而来以宠爱人寰之中而辉煌廊庙之上使中华无端宝藏折节而推上坐焉岂中国辉山媚水者萃在人身而天地菁华止有此数哉",
        "珠",
        "凡珍珠必产蚌腹映月成胎经年最久乃为至宝其云蛇蝮龙颔鲛皮有珠者妄也凡中国珠必产雷廉二池三代以前淮扬亦南国地得珠稍近禹贡“淮夷珠”或后互市之便非必责其土产也金采蒲里路元采杨村直沽口皆传记相承之妄何尝得珠至云忽吕古江出珠则夷地非中国也",
        "凡蚌孕珠乃无质而生质他物形小而居水族者吞噬弘多寿以不永蚌则环包坚甲无隙可投即吞腹囫囵不能消化故独得百年千年成就无价之宝也凡蚌孕珠即千仞水底一逢圆月中天即开甲仰照取月精以成其魄中秋月明则老蚌犹喜甚若彻晓无云则随月东升西没转侧其身而映照之他海滨无珠者潮汐震撼蚌无安身静存之地也",
        "凡廉州池自乌泥独揽沙至于青鸾可百八十里雷州池自对乐岛斜望石城界可百五十里户采珠每岁必以三月时牲杀祭海神极其虔敬户生啖海腥入水能视水色知蛟龙所在则不敢侵犯",
        "凡采珠舶其制视他舟横阔而圆多载草荐于上经过水漩则掷荐投之舟乃无恙舟中以长绳系没人腰携篮投水凡没人以锡造弯环空管其本缺处对掩没人口鼻令舒透呼吸于中别以熟皮包络耳项之际极深者至四五百尺拾蚌篮中气逼则撼绳其上急提引上无命者或葬鱼腹凡没人出水煮热毳急覆之缓则寒栗死",
        "宋朝李招讨设法以为耩最后木柱扳口两角坠石用麻绳作兜如囊状绳系舶两傍乘风扬帆而兜取之然亦有漂溺之患今户两法并用之",
        "凡珠在蚌如玉在璞初不识其贵贱剖取而识之自五分至一寸一分经者为大品小平似覆釜一边光彩微似镀金者此名珠其值一颗千金矣古来“明月”“夜光”即此便是白昼晴明檐下看有光一线闪烁不定“夜光”乃其美号非真有昏夜放光之珠也次则走珠置平底盘中圆转无定歇价亦与珠相仿化者之身受含一粒则不复朽坏故帝王之家重价购此次则滑珠色光而形不甚圆次则累珠次官雨珠次税珠次葱符珠幼珠如粱粟常珠如豌豆卑而碎者曰玑自夜光至于碎玑譬均一人身而王公至于氓隶也",
        "凡珠生止有此数采取太频则其生不继经数十年不采则蚌乃安其身繁其子孙而广孕宝质所谓珠徙珠还此煞定死谱非真有清官感召也我朝弘治中一采得二万八千两万历中一采止得三千两不偿所费",
        "宝",
        "凡宝石皆出井中西番诸域最盛中国惟出云南金齿卫与丽江两处凡宝石自大至小皆有石床包其外如玉之有璞金银必积土其上韫结乃成而宝则不然从井底直透上空取日精月华之气而就故生质有光明如玉产峻湍珠孕水底其义一也",
        "凡产宝之井即极深无水此乾坤派设机关但其中宝气如雾氤氲井中人久食其气多致死故采宝之人或结十数为群入井者得其半而井上众人共得其半也下井人以长绳系腰腰带叉口袋两条及泉近宝石随手疾拾入袋宝井内不容蛇虫腰带一巨铃宝气逼不得过则急摇其铃井上人引ㄌ提上其人即无恙然已昏瞢止与白滚汤入口解散三日之内不得进食粮然后调理平复其袋内石大者如碗中者如拳小者如豆总不晓其中何等色付与琢工钅虑错解开然后知其为何等色也",
        "属红黄种类者为猫精羯芽星汉砂琥珀木难酒黄喇子猫精黄而微带红琥珀最贵者名曰{玉}音依此值黄金五倍价红而微带黑然昼见则黑灯光下则红甚也木难纯黄色喇子纯红前代何妄人于松树注茯苓又注琥珀可笑也",
        "属青绿种类者为瑟瑟珠且母绿鸦鹘石空青之类空青既取内质其膜升打为空青至玫瑰一种如黄豆绿豆大者则红碧青黄数色皆具宝石有玫瑰如珠之有玑也星汉砂以上犹有煮海金丹此等皆西番产亦间气出滇中井所无",
        "时人伪造者唯琥珀易假高者煮化硫黄低者以殷红汁料煮入牛羊明角映照红赤隐然今亦最易辨认琥珀磨之有浆至引灯草原惑人之说凡物借人气能引拾轻芥也自来本草陋妄删去毋使灾木",
        "玉",
        "凡玉入中国贵重用者尽出于阗汉时西国号后代或名别失八里或统服赤斤蒙古定名未详葱岭所谓蓝田即葱岭出玉别地名而后世误以为西安之蓝田也其岭水发源名阿耨山至葱岭分界两河一曰白玉河一曰绿玉河后晋人高居海作于阗国行程记载有乌玉河此节则妄也",
        "玉璞不藏深土源泉峻急激映而生然取者不于所生处以急湍无着手俟其夏月水涨璞随湍流徙或百里或二三百里取之河中凡玉映月精光而生故国人沿河取玉者多于秋间明月夜望河候视玉璞堆聚处其月色倍明亮凡璞随水流仍错杂乱石浅流之中提出辨认而后知也",
        "白玉河流向东南绿玉河流向西北亦力把力地其地有名望野者河水多聚玉其俗以女人赤身没水而取者云阴气相召则玉留不逝易于捞取此或夷人之愚也夷中不贵此物更流数百里途远莫货则弃而不用",
        "凡玉唯白与绿两色绿者中国名菜玉其赤玉黄玉之说皆奇石琅之类价即不下于玉然非玉也凡玉璞根系山石流水未推出位时璞中玉软如棉絮推出位时则已硬入尘见风则愈硬谓世间琢磨有软玉则又非也凡璞藏玉其外者曰玉皮取为砚托之类其值无几璞中之玉有纵横尺余无瑕玷者古者帝王取以为玺所谓连城之璧亦不易得其纵横五六寸无瑕者治以为杯此亦当世重宝也",
        "此外惟西洋琐里有异玉平时白色晴日下看映出红色阴雨时又为青色此可谓之玉妖尚方有之朝鲜西北太尉山有千年璞中藏羊脂玉与葱岭美者无殊异其他虽有载志闻见则未经也凡玉由彼地缠头回其俗人首一岁裹布一层老则臃肿之甚故名缠头回子其国王亦谨不见发问其故则云见发则岁凶荒可笑之甚或溯河舟或驾橐驼经庄浪入嘉峪而至于甘州与肃州中国贩玉者至此互市而得之东入中华卸萃燕京玉工辨璞高下定价而后琢之良玉虽集京师工巧则推苏郡",
        "凡玉初剖时冶铁为圆盘以盆水盛沙足踏圆盘使转添沙剖玉逐忽划断中国解玉沙出顺天玉田与真定邢台两邑其沙非出河中有泉流出精粹如面藉以攻玉永无耗折既解之后别施精巧工夫得镔铁刀者则为利器也镔铁亦出西番哈密卫砺石中剖之乃得",
        "凡玉器琢余碎取入钿花用又碎不堪者碾筛和灰涂琴瑟琴有玉音以此故也凡镂刻绝细处难施锥刃者以蟾酥填画而后锲之物理制服殆不可晓凡假玉以充者如锡之于银昭然易辨近则捣舂上料白瓷器细过微尘以白敛诸汁调成为器干燥玉色烨然此伪最巧云",
        "凡珠玉金银胎性相反金银受日精必沉埋深土结成珠玉宝石受月华不受土寸掩盖宝石在井上透碧空珠在重渊玉在峻滩但受空明水色盖上珠有螺城螺母居中龙神守护人不敢犯数应入世用者螺母推出人取玉初孕处亦不可得玉神推徙入河然后恣取与珠宫同神异云",
        "附玛瑙　水晶　琉璃",
        "凡玛瑙非石非玉中国产处颇多种类以十余计得者多为簪{度}钩音扣结之类或为棋子最大者为屏风及棹面上品者产宁夏外徼羌地砂碛中然中国即广有商贩者亦不远涉也今京师货者多是大同蔚州九空山宣府四角山所产有夹胎玛瑙截子玛瑙锦红玛瑙是不一类而神木府谷出浆水玛瑙锦缠玛瑙随方货鬻此其大端云试法以砑木不热者为真伪者虽易为然真者值原不甚贵故不乐售其技也",
        "凡中国产水晶视玛瑙少杀今南方用者多福建漳浦产山名铜山北方用者多宣府黄尖山产中土用者多河南信阳州黑色者最美与湖广兴国州潘家山产黑色者产北不产南其他山穴本有之而采识未到与已经采识而官司厉禁封闭如广信惧中官开采之类者尚多也凡水晶出深山穴内瀑流石罅之中其水经晶流出昼夜不断流出洞门半里许其面尚如油珠滚沸凡水晶未离穴时如棉软见风方坚硬琢工得宜者就山穴成粗坯然后持归加功省力十倍云",
        "凡琉璃石与中国水精占城火齐其类相同同一精光明透之义然不产中国产于西域其石五色皆具中华人艳之遂竭人巧以肖之于是烧瓴<商瓦>转釉成黄绿色者曰琉璃瓦煎化羊角为盛油与笼烛者为琉璃碗合化硝铅写珠铜线穿合者为琉璃灯捏片为琉璃瓶袋硝用煎炼上结马牙者各色颜料汁任从点染凡为灯珠皆淮北齐地人以其地产硝之故",
        "凡硝见火还空其质本无而黑铅为重质之物两物假火为媒硝欲引铅还空铅欲留硝住世和同一釜之中透出光明形象此乾坤造化隐现于容易地面天工卷末著而出之"
      ]
    }
  ]
}